import ImageOne from '../assets/image_1_0.png'
import ImageTwo from '../assets/image_3_0.png'
import ImageThree from '../assets/image_6_0.png'
import ImageFour from '../assets/image_4_0.png'
import ImageFive from '../assets/image_2_0.png'
// import ImageSix from '../assets/image_5_0.png'
// import ImageSix from '../assets/monitoring-coverage_mockup.png'
import ImageSix from '../assets/monitoring-coverage.png'
import ImageSeven from '../assets/monitoring-duration.png'
import ImageEight from '../assets/monitoring-results.png'
import ImageNine from '../assets/results-by-office.png'
import ImageTen from '../assets/results-source.png'
import ImageEleven from '../assets/type-of-violation.png'
import * as am4core from '@amcharts/amcharts4/core'
import React from 'react'

export const MAX_MOBILE_WIDTH = 576

export const MONITORING = [
  {
    link: '/monitoring-results',
    value: 'Моніторинги за результатами',
    view: true,
  },
  {
    link: '/type-of-violation',
    value: 'Типи порушень',
    view: true,
  },
  // {
  //   link: '/results-by-office',
  //   value: 'За офісами ДАСУ',
  //   value: 'По офісам ДАСУ',
  // },
  {
    link: '/results-source',
    value: 'Результати - по джерелам',
    // value: 'За підставами для здійснення моніторингу',
    // value: 'По джерелам',
    view: true,
  },
  {
    link: '/results-by-office',
    value: 'Результати - по підрозділам Держаудитслужби',
    view: true,
    // value: 'Порівняння динаміки аудиторів з динамікою процедур по офісам ДАСУ',
  },
]

export const RESOURCES = [
  {
    link: '/resources',
    value: 'Територіальні підрозділи та кількість аудиторів',
    view: true,
  },
  // {
  //   link: '/new-page',
  //   value: 'Закони та методології',
  // },
  {
    link: '/comparative-dynamics',
    value: 'Порівняльна динаміка роботи аудиторів',
    view: true,
    // value: 'Порівняння динаміки аудиторів з динамікою процедур по офісам ДАСУ',
  },
]

export const PROCEDURES = [
  {
    link: '/monitoring-market',
    value: 'Моніторинг за галузями',
    view: true,
    // value: 'Моніторинг по ринках',
  },
  {
    link: '/monitoring-regions',
    value: 'Моніторинг за регіонами',
    view: true,
    // value: 'Моніторинг за регіонами',
  },
  {
    link: '/monitoring-procurement-methods',
    value: 'Моніторинг за типами процедур',
    view: true,
    // value: 'Моніторинг по типам процедур',
  },
  {
    link: '/monitoring-duration',
    // value: 'Моніторинг за тривалістю',
    value: 'Моніторинг за тривалістю',
    view: true,
  },
  {
    link: '/monitoring-coverage',
    value: 'Покриття моніторингом',
    view: true,
    // value: 'Покриття моніторингом',
  },
]

export const CHANGE_AMCHARTS = [
  {
    path: '/resources',
    component: 'ResourcesChartPart',
  },
  {
    path: '/new-page',
    component: 'NewPageChartPart',
  },
  {
    path: '/comparative-dynamics',
    component: 'ComparativeDynamics',
  },
  {
    path: '/monitoring-market',
    component: 'MarketMonitoringChart',
  },
  {
    path: '/monitoring-regions',
    component: 'RegionsMonitoringChart',
  },
  {
    path: '/monitoring-duration',
    component: 'DurationMonitoring',
  },
  {
    path: '/monitoring-procurement-methods',
    component: 'TypesMonitoring',
  },
  {
    path: '/results-source',
    component: 'ResultsSource',
  },
  {
    path: '/results-by-office',
    component: 'ResultsByOffice',
  },
  {
    path: '/type-of-violation',
    component: 'TypeOfViolation',
  },
  {
    path: '/monitoring-results',
    component: 'ResultsMonitoring',
  },
  {
    path: '/monitoring-coverage',
    component: 'MonitoringCoverage',
  },
  {
    path: '/calculation-methodology',
    component: 'CalculationMethodology',
  },
]

export const HOMEPAGE = [
  {
    link: '/',
  },
  {
    link: '/calculation-methodology',
  },
]

export const CHANGE_TOP_SECTION = [
  {
    path: '/resources',
    subTitle: 'Територіальні підрозділи та кількість аудиторів',
    title: 'Загальна кількість аудиторів, які проводили моніторинги',
    description: 'Аудитори проводять моніторинг, щоб виявити порушення під час проведення процедури закупівлі, укладання і виконання договору',
    display: true,
  },
  {
    path: '/new-page',
    subTitle: 'Територіальні підрозділи та кількість аудиторів',
    title: 'Аудиторів з початку проведення моніторингів',
    description: 'Аудитори вищої кваліфікації займаються перевіркою фінансової та податкової звітності, а також оцінють фінансову ефективність діяльності.',
    currency: 3572,
    display: true,
  },
  {
    path: '/comparative-dynamics',
    subTitle: 'Порівняльна динаміка роботи аудиторів',
    // title: 'Охоплено процедур закупівель моніторингами',
    title: 'Покриття процедур закупівель моніторингами',
    // description: 'Кількість процедур, щодо яких проводився моніторинг',
    // description: 'Кількість процедур, що потрапили під моніторинг Держаудитслужби',
    description: 'Кількість процедур закупівель, що потрапили під моніторинг Держаудитслужби за весь період',
    currency: '98%',
    display: true,
  },
  {
    path: '/monitoring-market',
    // subTitle: 'Моніторинг по ринках',
    subTitle: 'Моніторинг за галузями',
    title: 'Загальна кількість номенклатур, що потрапляли під моніторинг',
    // description: 'У межах однієї закупівлі можуть закуповуватись різні номенклатурні позиції, які є одним предметом закупівлі',
    description: 'Кількість унікальних кодів Єдиного Закупівельного Словника, що зустрічались у процедурах з моніторингами.',
    currency: 8537,
    display: true,
  },
  {
    path: '/monitoring-regions',
    subTitle: 'Моніторинг за регіонами',
    title: 'Замовники, що проводили процедури закупівель',
    description: 'Кожен замовник протягом року проводить різну кількість закупівель в залежності від потреб та ресурсів',
    display: true,
  },
  {
    path: '/monitoring-duration',
    subTitle: 'Моніторинг за тривалістю',
    title: 'Загальний час, затрачений на моніторинги',
    description: 'Час проведення моніторингу — різний, залежно від складності закупівлі та кількості порушень, та не може бути довшим за 15 робочих днів',
    currency: 1825,
    display: true,
  },
  {
    path: '/monitoring-procurement-methods',
    // subTitle: 'Моніторинг по типам процедур',
    subTitle: 'Моніторинг за типами процедур',
    // title: 'Покрито замовників моніторингами',
    // title: 'Охоплено замовників моніторингами',
    title: 'Охоплено замовників моніторингами за весь час аналізу',
    // description: 'У Законі "Про публічні закупівлі" зазначений перелік закупівель, до яких застосовується моніторинг.',
    description: 'У Законі “Про публічні закупівлі” зазначений перелік закупівель, щодо яких може проводитися моніторинг',
    currency: `${95}%`,
    display: true,
  },
  {
    path: '/results-source',
    subTitle: 'Результати - по джерелам',
    title: 'Вартість закупівель, що потрапили під моніторинг за весь період',
    // description: 'Це очікувана вартість усіх процедур, де тривають чи завершені моніторинги (порушення можуть виявити чи визнати їхню відсутність)',
    // description: 'Це очікувана вартість усіх процедур, де моніторинги завершені. В результаті порушення можуть бути виявлені або встановлено їх відсутність.',
    // description: 'Це очікувана вартість усіх процедур, де тривають чи завершені моніторинги (порушення можуть виявити чи визнати їх відсутність)',
    description: 'Сума очікуваних вартостей процедур з завершеними моніторингами (в результаті моніторингу можуть виявити чи не виявити порушення)',
    currency: 8647,
    display: true,
  },
  {
    path: '/results-by-office',
    subTitle: 'Результати - по підрозділам Держаудитслужби',
    title: 'Середня кількість порушень, виявлена підрозділами Держаудитслужби',
    description: 'Цей показник отримуємо, поділивши усю виявлену чисельність порушень за весь період проведення моніторингів на кількість підрозділів Держаудитслужби по Україні',
    currency: 12598,
    display: true,
  },
  {
    path: '/type-of-violation',
    subTitle: 'Типи порушень',
    // title: 'Кількість процедур з порушенням',
    title: 'Загальна кількість замовників, що порушували',
    description: 'У замовника може бути виявлено порушення в одній або більше закупівель. Порушення можуть бути однотипними або щоразу різними',
    currency: 8647,
    display: true,
  },
  {
    path: '/monitoring-results',
    subTitle: 'Моніторинги за результатами',
    // title: 'Загальна сума процедур за результатами  моніторингів',
    // title: 'Загальна кількість замвоників, що порушували',
    title: 'Загальна сума процедур, що потрапили під моніторинг',
    description: 'Ми уважно досліджуємо, як проходять закупівлі з тими ж учасниками, що допускали порушення у минулому',
    currency: 950,
    display: true,
  },
  {
    path: '/monitoring-coverage',
    subTitle: 'Покриття моніторингом',
    title: 'Загальна вартість пропозицій переможців',
    description: 'Сума пропозицій учасників, що були визнані переможцями закупівель.',
    currency: 950,
    display: true,
  },
  {
    path: '/calculation-methodology',
    subTitle: 'МЕТОДОЛОГІЯ РОЗРАХУНКУ ПОКАЗНИКІВ',
    title: '',
    description: '',
    currency: 0,
    display: false,
  },
]

export const REGIONS_LIST = [
  {
    label: 'Вінницька область',
    value: 2,
  },
  {
    label: 'Волинська область',
    value: 3,
  },
  {
    label: 'Дніпропетровська область',
    value: 4,
  },
  {
    label: 'Донецька область',
    value: 5,
  },
  {
    label: 'Житомирська область',
    value: 6,
  },
  {
    label: 'Закарпатська область',
    value: 7,
  },
  {
    label: 'Запорізька область',
    value: 8,
  },
  {
    label: 'Івано-Франківська область',
    value: 9,
  },
  {
    label: 'Київська область',
    value: 10,
  },
  {
    label: 'Кіровоградська область',
    value: 11,
  },
  {
    label: 'Луганська область',
    value: 12,
  },
  {
    label: 'Львівська область',
    value: 13,
  },
  {
    label: 'Миколаївська область',
    value: 14,
  },
  {
    label: 'Одеська область',
    value: 15,
  },
  {
    label: 'Полтавська область',
    value: 16,
  },
  {
    label: 'Рівненська область',
    value: 17,
  },
  {
    label: 'Сумська область',
    value: 18,
  },
  {
    label: 'Тернопільська область',
    value: 19,
  },
  {
    label: 'Харківська область',
    value: 20,
  },
  {
    label: 'Херсонська область',
    value: 21,
  },
  {
    label: 'Хмельницька область',
    value: 22,
  },
  {
    label: 'Черкаська область',
    value: 23,
  },
  {
    label: 'Чернівецька область',
    value: 24,
  },
  {
    label: 'Чернігівська область',
    value: 25,
  },
  {
    label: 'м. Київ',
    value: 26,
  },
  {
    label: 'АР Крим',
    value: 1,
  },
]

export const INSTRUCTION = [
  {
    path: '/resources',
    top: <div>На цій сторінці відображаються наступні показники:
      <br /><br />
      <ol className="ol-list">
        <li>
          <strong>Загальна кількість аудиторів, які проводили моніторинги</strong> - це кількість аудиторів, що
          провели хоча б один моніторинг за весь час аналізу. Підрахунок ведеться за даними електронних підписів
          аудиторів, що зберігає система під час проведення моніторингів.
          {/*<br />*/}
          {/*<br />*/}
          {/*<strong>Складності підрахунку та ухвалені рішення: </strong> наразі в АРІ Прозорро є складність, що не*/}
          {/*дозволяє точно прив’язати аудитора, що робив якісь дії для запуску/ведення моніторингу, до публікації*/}
          {/*висновку. Отож, оскільки точно визначити усю кількість аудиторів, що брали участь в моніторингу*/}
          {/*закупівлі наразі змоги немає, для потреб аналітики ми визначатимемо аудитора, як особу, що робила*/}
          {/*останню за хронологією публікацію чогось в межах моніторингу.*/}
        </li>
        <li>
          <strong>Кількість аудиторів, які здійснювали моніторинг у відповідному періоді</strong> - це кількість
          аудиторів, що провели хоча б один моніторинг в обраному періоді. Підрахунок ведеться за даними
          електронних підписів аудиторів, що зберігає система під час проведення моніторингів.
          {/*<br />*/}
          {/*<br />*/}
          {/*<strong>Складності підрахунку та ухвалені рішення:</strong> див. пункт 1.*/}
        </li>
        <li>
          <strong>Розподіл аудиторів, що проводили моніторинги по регіональних підрозділах Держаудитслужби
            (мапа)</strong> - кількість аудиторів, що провели хоча б один моніторинг у періоді, що розподілені
          по територіальних підрозділах Держаудитслужби. Підрахунок та розподіл ведеться за даними електронних
          підписів аудиторів, що зберігає система під час проведення моніторингів.
        </li>
        <li>
          <strong>Кількість аудиторів, що проводили моніторинги (лінійний графік)</strong> - кількість
          аудиторів, що провели хоча б один моніторинг по місяцях обраного періоду та розподілені по
          територіальних підрозділах Держаудитслужби (якщо на мапі обрані окремі підрозділи). Підрахунок та
          розподіл ведеться за даними електронних підписів аудиторів, що зберігає система під час проведення
          моніторингів.
        </li>
      </ol>
      Фільтри на сторінці:
      <br /><br />
      <ul className="ul-list">
        <li><strong>Фільтр вибору періоду</strong> - визначає період, для якого будується аналітика. Впливає на
          показники <strong>2</strong>, <strong>3</strong> та <strong>4</strong>.
        </li>
        <li><strong>Фільтр за територіальним підрозділом Держаудитслужби</strong> - визначає
          підрозділ/підрозділи для аналізу (фільтрація за допомогою вибору на мапі). За замовчуванням обрані всі
          підрозділи. Впливає на показники <strong>2</strong> та <strong>4</strong>.
        </li>
      </ul>
    </div>,
    middle: '',
    bottom: '',
  },
  {
    path: '/comparative-dynamics',
    top: <div>Сторінка призначена для аналізу навантаження на аудиторів. Відображаються
      наступні показники:
      <br /><br />
      <ol className="ol-list">
        <li><strong>Охоплено процедур закупівель моніторингами</strong> - статичний показник, що показує, щодо
          якої кількості процедур було проведено моніторинг за весь час аналізу.
        </li>
        <li><strong>Охоплено процедур закупівель моніторингами за обраний період за вартістю</strong> -
          динамічний показник, що розраховується як відсоток суми процедур, оголошених в періоді, щодо яких було
          проведено моніторинг від суми усіх процедур, що були оголошені в періоді.
        </li>
        <li><strong>Лінійний графік продуктивності аудиторів</strong> - складається з трьох лінійних діаграм:
          <ul className="ul-list">
            <li><strong>Кількість процедур (сума процедур)</strong> - кількість процедур (сума очікуваних
              вартостей процедур), щодо яких проведено моніторинг. Відображається помісячно для кожного місяця
              обраного періоду.
            </li>
            <li><strong>Кількість аудиторів</strong> - кількість унікальних аудиторів, що проводили моніторинги
              в цей місяць обраного періоду.
            </li>
            <li><strong>Продуктивність аудиторів</strong> - середнє навантаження на одного аудитора, що
              розраховується як відношення кількості процедур (суми очікуваних вартостей процедур), щодо яких
              проведено моніторинг, до кількості аудиторів, які проводили моніторинги. Розраховується для
              кожного місяця обраного періоду.
            </li>
          </ul>
          <strong>Примітка:</strong> при наведенні на графіку на місяць, відповідні значення відображаються в
          правому верхньому куті кожної діаграми.
        </li>
      </ol>
      Фільтри на сторінці:
      <br /><br />
      <ul className="ul-list">
        <li><strong>Фільтр вибору періоду</strong> - визначає період, для якого будується аналітика. Впливає на
          показники <strong>2</strong> та <strong>3</strong>.
        </li>
      </ul>

    </div>,
    middle: '',
    bottom: '',
  },
  {
    path: '/monitoring-market',
    top: <div>Сторінка призначена для ознайомлення з галузевим розподілом моніторингів.
      Користувач має змогу побачити ті галузі та їхні окремі ніші, де концентрується найбільша кількість
      порушень або вага порушень є найвищою (за сумою процедур закупівель). За Законом “Про публічні закупівлі”
      замовник для кожного предмету закупівлі має вказати код цього предмету закупівлі з Єдиного Закупівельного
      Словника (ЄЗС), розкривши його до 4-го знаку. Галузевий аналіз на цій аналітичній сторінці був
      побудований, базуючись саме на структурі ЄЗС.
      <br /><br />
      Кожен код предмету з ЄЗС складається з 9 цифр. Словник має ієрархічну структуру, тож цифри коду зліва показують
      приналежність предмету закупівлі до певної групи. Для аналітичних графіків використовується наступний поділ:
      <br /><br />
      <ul className="ul-list">
        <li><strong>Перші дві цифри коду визначають розділ</strong> - саме розділи словника використовуються як
          найбільш загальний поділ усіх предметів закупівель на галузі економіки (всього таких розділів в ЄЗС
          46);
        </li>
        <li><strong>Перші 3 цифри коду визначають групу предметів закупівель</strong> - другий рівень
          деталізації предметів закупівель (всього таких груп в ЄЗС 273);
        </li>
        <li><strong>Перші 4 цифри коду визначають клас предмету закупівлі</strong> - третій і останній рівні
          деталізації предметів закупівель на сторінці (всього класів в ЄЗС 1 006).
        </li>
      </ul>
      До аналізу відібрані лише ті процедури, де вказано тип предмету закупівлі: товари, роботи чи послуги.
      <br />
      <br />
      Відображаються наступні показники:
      <ol className="ol-list">
        <li><strong>Загальна кількість номенклатур, що потрапляла під моніторинг</strong> - статичний показник,
          що показує загальну кількість вказаних замовниками кодів (оригінальні коди, що вказані замовниками у
          процедурах закупівель, без жодної корекції) предметів закупівель у процедурах, щодо яких було
          проведено моніторинг за весь період аналізу.
        </li>
        <li><strong>Розділи Єдиного Закупівельного Словника, що потрапляли під моніторинг</strong> - динамічний
          показник, що відображає кількість розділів ЄЗС предмети закупівель, з яких були присутні у процедурах
          закупівель, щодо яких було проведено моніторинг.
        </li>
        <li><strong>Список розділів ЄЗС з кількістю (сумою очікуваних вартостей) процедур</strong> - це
          динамічний показник-список, що відображає назву розділу ЄЗС, його код (перші 2 цифри в коді предмету
          закупівлі) та загальну кількість (суму очікуваних вартостей) процедур, щодо яких було проведено
          моніторинг.
        </li>
        <li><strong>Динаміка моніторингів процедур, у яких коди предметів закупівель належать до визначеного
          розділу</strong> - це лінійна діаграма, що залежна від елемента списку попереднього показника.
          Користувач має змогу отримати розподіл за місяцями обраного періоду для кожного елемента списку
          попереднього показника.
        </li>
        <li><strong>Групи та класи предметів закупівель, що найчастіше потрапляли під моніторинг</strong> - це
          інтерактивна бульбашкова діаграма, що побудована за ієрархічним принципом, де найвищий рівень являє
          собою тип предмету закупівлі: товари, послуги чи роботи; наступний рівень, що відкривається і
          закривається при натисканні на відповідну бульбашку - це розділи ЄЗС, предмети закупівель, з яких
          найчастіше опинялися у процедурах з моніторингом (на графіку виводиться ТОП-5 розділів за
          кількістю/очікуваною вартістю). При натисканні на бульбашку розділу ЄЗС користувачу пропонується
          наступний рівень ієрархії - ТОП-5 груп ЄЗС, що належать до обраного розділу, предмети закупівель яких
          найчастіше опинялись у процедурах з моніторингом. І, нарешті, обрана група ЄЗС розкривається до ТОП-5
          класів з цієї групи, предмети закупівель з яких найчастіше опинялись у процедурах з моніторингом.
          <br />
          <br />
          <strong>Відображення показників на бульбашках:</strong> на кожній бульбашці за замовчуванням
          відображається показник у відсотках. Цей показник відображає відсоткове співвідношення тих предметів
          закупівель (за кількість/сумою очікуваних вартостей процедур), що входять у поточну бульбашку до
          кількості предметів закупівель (за кількість/сумою очікуваних вартостей процедур) з батьківської
          бульбашки. Так отримуємо такі рівні ієрархії:
          <ul className="ul-list">
            <li><strong>Верхній рівень</strong> - Товари/Послуги/Роботи: ці кульки не мають батьківських, тож на
              них відображається частка за кількістю/сумою очікуваних вартостей усіх процедур, що потрапили під
              моніторинг;
            </li>
            <li><strong>Рівень розділів</strong> - бульбашки з назвами розділів, у яких відображається частка за
              кількістю/сумою очікуваних вартостей усіх процедур з предметами закупівель цього розділу від
              кількості/суми очікуваних вартостей процедур з моніторингом, що мали такий самий тип предмету
              закупівлі (Товари/Послуги/Роботи).
            </li>
            <li>
              <strong>Рівень групи</strong>
              - відсоток процедур (кількість/вартість) з моніторингом цієї групи від усіх процедур з розділу, до
              якого належить група;
            </li>
            <li>
              <strong>Рівень класу</strong>
              - відсоток процедур (кількість/вартість) з моніторингом цього класу від усіх процедур з групи, до
              якої належить клас.
            </li>
          </ul>
        </li>
      </ol>
      Фільтри на сторінці:
      <br /><br />
      <ul className="ul-list">
        <li><strong>Фільтр вибору періоду</strong> - визначає період, для якого будується аналітика. Впливає
          на показники <strong>2</strong>, <strong>3</strong>, <strong>4</strong>, та <strong>5</strong>.
        </li>
        <li><strong>Фільтр “Замовники за регіонами”</strong> - визначає регіон чи регіони території України,
          замовники з яких проводили процедури закупівель. За замовчуванням аналітика будується по всіх
          регіонах країни разом.
        </li>
      </ul>
    </div>,
    middle: '',
    bottom: '',
  },
  {
    path: '/monitoring-regions',
    top: <div>Сторінка відображає територіальний розподіл моніторингів. Оскільки кожен
      замовник, що проводить процедуру закупівлі, розташований в певному регіоні країни, дуже важливо мати
      уявлення, скільки замовників потрапило під контроль у різних регіонах України.
      <br /><br />
      <ol className="ol-list">
        <li>
          <strong>Замовники, що проводили процедури закупівель</strong>
          - це загальна кількість замовників, що провели хоча б одну процедуру закупівлі за весь час аналізу.
        </li>
        <li><strong>Кількість замовників, процедури яких моніторили аудитори</strong> - кількість унікальних
          замовників, процедури яких хоч раз попадали під моніторинг в обраному періоді.
        </li>
        <li><strong>Мапа замовників, процедури яких потрапляли під моніторинг аудиторів</strong> -
          територіальний розподіл унікальних замовників, процедури яких хоча б раз попадали під моніторинг в
          обраному періоді.
        </li>
        <li><strong>Сума процедур з моніторингом</strong> - стовпчикова діаграма, що відображає п'ятірку
          найкращих розділів ЄЗС, предмети закупівель з яких найчастіше опинялись в процедурах з моніторингами.
          Рахується як частка процедур з моніторингами з предметами закупівель з розділу від усіх процедур з
          моніторингами (відсоток за кількістю або за сумою очікуваних вартостей процедур).
        </li>
      </ol>
      Фільтри на сторінці:
      <br /><br />
      <ul className="ul-list">
        <li><strong>Фільтр вибору періоду</strong> - визначає період, для якого будується аналітика. Впливає на
          показники <strong>2</strong>, <strong>3</strong> та <strong>4</strong>.
        </li>
        <li><strong>Фільтр “Замовники за регіонами”</strong> (відбір регіонів на мапі) - визначає регіон чи
          регіони України, замовники з яких проводили процедури закупівель. За замовчуванням аналітика будується
          по всіх регіонах країни.
        </li>
        <li><strong>Фільтр “Територіальний підрозділ Держаудитслужби”</strong> - дозволяє проводити відбір лише
          тих замовників та їхніх процедур закупівель, моніторинги на які проводили співробітники обраних
          територіальних підрозділів Держаудитслужби. За замовчуванням аналітика будується на моніторингах усіх
          підрозділів.
        </li>
      </ul>
    </div>,
    middle: '',
    bottom: '',
  },
  {
    path: '/monitoring-procurement-methods',
    top: <div>Сторінка містить показники, щодо типів закупівельних процедур.
      <br /><br />
      <ol className="ol-list">
        <li><strong>Охоплено замовників моніторингами</strong> - статичний показник, що відображає кількість
          унікальних замовників, хоча б одна процедура яких потрапляла під моніторинг за весь час аналізу.
        </li>
        <li><strong>Процедури закупівель, по яких проведено моніторинг</strong> - інтерактивний показник, що
          відображає кількість процедур, щодо яких проведено моніторинг у обраному періоді.
        </li>
        <li><strong>Розподіл процедур, що потрапили під моніторинг за типами</strong> - інтерактивна кругова
          діаграма, що відображає відсотки (за кількістю або сумою очікуваних вартостей) процедур, що потрапляли
          під моніторинг за їхніми типами у обраному періоді.
        </li>
        <li><strong>Охоплено моніторингом</strong> - інтерактивний показник, що відображає кількість/суму
          очікуваних вартостей процедур, що охоплені моніторингом у обраному періоді.
        </li>
        <li><strong>Охоплено замовників</strong> - інтерактивний показник, що відображає кількість унікальних
          замовників, хоча б одна процедура яких потрапляла під моніторинг у обраному періоді.
        </li>
        <li><strong>Динаміка кількості (суми очікуваних вартостей) моніторингів</strong> (лінійна діаграма) -
          інтерактивна лінійна діаграма, що відображає кількість/суму очікуваних вартостей процедур, що охоплені
          моніторингом помісячно у обраному періоді.
        </li>
      </ol>
      Фільтри на сторінці:
      <br /><br />
      <ul className="ul-list">
        <li><strong>Фільтр вибору періоду</strong> - визначає період, для якого будується аналітика. Впливає на
          показники <strong>2</strong>, <strong>3</strong> , <strong>4</strong> , <strong>5</strong> та <strong>6</strong>.
        </li>
        <li><strong>Фільтр “Регіон замовника”</strong> - визначає регіон чи регіони України, замовники з яких
          проводили процедури закупівель, що потрапили під моніторинг. За замовчуванням аналітика будується по
          всіх регіонах країни.
        </li>
      </ul>
    </div>,
    middle: '',
    bottom: '',
  },
  {
    path: '/monitoring-duration',
    top: <div>
      Ця аналітична сторінка відображає ще один важливий аспект моніторингового контролю - терміни виконання.
      <br /><br />
      <ol className="ol-list">
        <li><strong>Загальний час, затрачений на моніторинги</strong> - статичний показник, що відображає
          кількість днів, що були затрачені на проведення моніторингів за весь період аналізу.
          <br />
          <br />
          <strong>Складності підрахунку та ухвалені рішення: </strong>аудитори проводять по декілька
          моніторингів одночасно та не витрачають на кожен моніторинг весь свій робочий час. Проте наразі не
          існує цифрової системи, де б аудитори відображали дані щодо того, скільки саме часу вони витрачали на
          роботу в межах кожного моніторингу. Отже, для цілей аналітики час, що затрачений на моніторинг - це
          кількість днів від початку моніторингу до публікації висновку про результати моніторингу.
        </li>
        <li><strong>Час, затрачений на моніторинги</strong> - інтерактивний показник, що відображає кількість
          днів, що були затрачені на проведення моніторингів за обраний період.
        </li>
        <li><strong>Середня тривалість моніторингу по видах процедур</strong> - інтерактивний показник, що
          відображає середній час, який витрачається на проведення моніторингу залежно від типу конкурентності
          процедури. Окремо виводяться показники по конкурентних і неконкурентних процедурах в обраному періоді.
        </li>
        <li><strong>Середня тривалість моніторингу по підрозділах Держаудитслужби</strong> (мапа) - інтерактивні
          показники на мапі, що відображають середній час, що затрачається на проведення моніторингу у різних
          підрозділах Держаудитслужби в обраному періоді.
        </li>
        <li><strong>Діаграма розмаху тривалості моніторингів по кожному типу процедур закупівель</strong> -
          інтерактивна діаграма, що відображає розмах тривалостей моніторингів (від найкоротшого до найдовшого)
          по кожному типу процедур закупівель в обраному періоді.
        </li>
      </ol>
      Фільтри на сторінці:
      <br /><br />
      <ul className="ul-list">
        <li><strong>Фільтр вибору періоду</strong> - визначає період, для якого будується аналітика. Впливає на
          показники <strong>2</strong>, <strong>3</strong> , <strong>4</strong> та <strong>5</strong>.
        </li>
        <li><strong>Фільтр “Територіальний підрозділ Держаудитслужби”</strong> (відбір на мапі) - показники
          розраховуються лише на тих моніторингах, які проводили співробітники обраних територіальних
          підрозділів Держаудитслужби. За замовчуванням аналітика будується на моніторингах усіх підрозділів.
          Впливає на показники <strong>2</strong> , <strong>3</strong> та <strong>5</strong>
          всіх регіонах країни.
        </li>
      </ul>
    </div>,
    middle: '',
    bottom: '',
  },
  {
    path: '/monitoring-coverage',
    // middle: <div><span className="highlight-word">Дані</span> можна </div>,
    top: <div>На цій сторінці представлена інформація щодо охоплення закупівельних процедур моніторингами. Аналітика
      дозволяє побачити, яка частина з усіх оголошених у періоді закупівель потрапляє під моніторинг
      Держаудитслужби. Для порівняння на цій сторінці виведені два типи грошових показників - сума очікуваних
      вартостей та сума пропозицій переможців. У чому ж різниця і навіщо два показники?
      <br />
      <br />
      <i>Очікувана вартість процедури</i> - це оціночна вартість закупівлі, визначена замовником до початку
      проведення
      торгів. У конкурентних процедурах закупівель ця сума також виступає як верхня межа, що замовник може
      сплатити в межах закупівлі.
      <br />
      <br />
      <i>Сума пропозиції переможця</i> - це вартість пропозиції учасника торгів, що визнана найкращою, і на
      основі цієї
      пропозиції замовник планує укладати договір з цим учасником.
      <br />
      <br />
      Для побудови цієї аналітики беруться до уваги лише суми пропозицій переможців для завершених процедур
      закупівель, тобто тих, що завершилися підписанням договору з постачальником. Очікувану вартість мають усі
      процедури: завершені, відмінені та ті, що ще тривають. Отож, наявність на сторінці показника “сума
      пропозицій переможців” дає можливість порівняти, на яку суму планують закупити Товари/Послуги/Роботи та
      проводять закупівлі, та суму, що фактично витрачають на Товари/Послуги/Роботи у обраному періоді.
      <br /><br />
      <ol className="ol-list">
        <li><strong>Загальна вартість пропозицій переможців</strong> - це статичний показник, що відображає
          загальну суму пропозицій переможців у завершених процедурах закупівель за весь час аналізу.
        </li>
        <li><strong>Загальна вартість пропозицій переможців</strong> за період - інтерактивний показник, що
          відображає загальну суму пропозицій переможців у завершених процедурах закупівель за обраний період.
        </li>
        <li><strong>Потокова діаграма покриття моніторингами процедур закупівель</strong> - діаграма, що
          дозволяє користувачу скласти уявлення про покриття (за кількістю/сумою очікуваних вартостей)
          моніторингами процедур закупівель у обраному періоді. “Статуси закупівлі” -
          вершини <strong>А</strong> (активні процедури), <strong>B</strong> (завершені процедури)
          та <strong>C</strong> (відмінені процедури) - формують вершину <strong>D</strong> “Закупівлі, для яких
          можна проводити моніторинг”, що являє собою сукупність усіх процедур, що були оголошені в обраному
          періоді та є чи були під контролем Держаудитслужби.
          <br />
          <br />
          Так само усі процедури з вершини <strong>D</strong> далі по факту взяття закупівлі до моніторингу
          розділяються на ті, щодо яких проведено моніторинг (вершина <strong>Е</strong>) та на ті, щодо яких
          моніторинг не проводився (вершина <strong>F</strong>). І нарешті ті процедури, щодо яких проведено
          моніторинг, поділяються по результату моніторингу на ті, де були виявлені порушення
          (вершина <strong>G</strong>) та ті, де порушень не було виявлено (вершина <strong>H</strong>).
        </li>
      </ol>
      Фільтри на сторінці:
      <br /><br />
      <ul className="ul-list">
        <li><strong>Фільтр вибору періоду</strong> - визначає період, для якого будується аналітика. Впливає на
          показники <strong>2</strong> та <strong>3</strong>.
        </li>
      </ul>
    </div>,
    middle: '',
    bottom: '',
  },
  {
    path: '/monitoring-results',
    top: <div>
      Сторінка створена, щоб користувач зміг оцінити результати проведення моніторингів.
      <br /><br />
      <ol className="ol-list">
        <li><strong>Загальна сума процедур, що потрапили під моніторинг</strong> - це статичний показник, що
          відображає загальну суму очікуваних вартостей процедур закупівель, що потрапили під моніторинг за весь
          час аналізу.
        </li>
        <li><strong>Кількість процедур з моніторингами за період</strong> - інтерактивний показник, що
          відображає кількість процедур, щодо яких було проведено моніторинг в обраному періоді.
        </li>
        <li><strong>Кількість (сума очікуваних вартостей) процедур з моніторингами за період</strong> (мапа) -
          інтерактивна мапа, що відображає кількість (суму очікуваних вартостей) процедур, щодо яких було
          проведено моніторинг в обраному періоді. Територіальний розподіл зроблено за регіонами замовників, що
          проводили закупівлі.
        </li>
        <li><strong>Кругова діаграма результатів моніторингів</strong> - інтерактивна діаграма, що відображає
          відсоткові частки за кількістю (сумою очікуваних вартостей процедур) результатів завершених
          моніторингів в обраному періоді.
        </li>
        <li><strong>Динаміка результатів моніторингів за кількістю (сумою очікуваних вартостей процедур з
          моніторингами) по місяцях обраного періоду</strong> - інтерактивна мапа, що відображає кількість (суму
          очікуваних вартостей) процедур, щодо яких був проведений моніторинг в обраному періоді. Територіальний
          розподіл зроблено за регіонами замовників, що проводили закупівлі
        </li>
      </ol>
      Фільтри на сторінці:
      <br /><br />
      <ul className="ul-list">
        <li><strong>Фільтр вибору періоду</strong> - визначає період, для якого будується аналітика. Впливає на
          показники <strong>2</strong>, <strong>3</strong>, <strong>4</strong> та <strong>5</strong>.
        </li>
      </ul>
    </div>,
    middle: '',
    bottom: '',
  },
  {
    path: '/type-of-violation',
    top: <div>
      Ця аналітична сторінка служить для аналізу даних щодо виявлених порушень в процедурах закупівель у процесі
      моніторингу.
      <br /><br />
      <ol className="ol-list">
        <li><strong>Загальна кількість замовників, що порушували</strong> - статичний показник, що відображає
          кількість унікальних замовників, у процедурах закупівель яких в процесі моніторингів було знайдено
          хоча б одне порушення за весь час аналізу.
        </li>
        <li><strong>Кількість замовників, що порушували, за обраний період</strong> - інтерактивний показник, що
          відображає кількість унікальних замовників, у процедурах закупівель яких в процесі моніторингів було
          знайдено хоча б одне порушення за обраний період.
        </li>
        <li><strong>Кількість процедур з порушенням (відсоток процедур з цим порушенням від усіх процедур з
          порушеннями)</strong> - інтерактивний показник, що відображає кількість (відсоток від усіх процедур з
          порушеннями) процедур, в яких було виявлено це порушення в обраному періоді.
        </li>
        <li><strong>Мапа розташування замовників/кількість їхніх процедур/сума їхніх процедур</strong> -
          інтерактивна мапа розташування замовників/кількість їхніх процедур/сума їхніх процедур, де були
          знайдені обрані порушення. За замовчуванням виводяться показники по усіх типах порушень.
        </li>
      </ol>
      Фільтри на сторінці:
      <br /><br />
      <ul className="ul-list">
        <li><strong>Фільтр вибору періоду</strong> - визначає період, для якого будується аналітика. Впливає на
          показники <strong>2</strong>, <strong>3</strong> та <strong>4</strong>.
        </li>
        <li><strong>Фільтр вибору типу порушення</strong> (відбір елементів зі списку порушень, знаходиться
          ліворуч від карти) - визначає тип/типи порушень, щодо яких будуватимуться показники. Впливає на
          показники <strong>2</strong> і <strong>4</strong>.
        </li>
        <li><strong>Фільтр вибору підрозділу Держаудитслужби</strong> - відбір до аналізу лише тих порушень, що
          виявили аудитори з обраного/обраних підрозділів. Впливає на
          показники <strong>2</strong>, <strong>3</strong> і <strong>4</strong>.
        </li>
      </ul>
    </div>,
    middle: '',
    bottom: '',
  },
  {
    path: '/results-source',
    top: <div>
      Сторінка розроблена для аналізу ефективності джерел ініціації моніторингів.
      <br /><br />
      <ol className="ol-list">
        <li><strong>Вартість закупівель, що потрапили під моніторинг за весь час</strong> - статичний показник,
          що відображає суму очікуваних вартостей процедур, щодо яких було проведено моніторинг.
        </li>
        <li><strong>Сума переможних тендерних пропозицій у процедурах, охоплених моніторингом за
          період </strong> - сума переможних тендерних пропозицій у процедурах, щодо яких було проведено
          моніторинг за обраний період.
        </li>
        <li><strong>Стовпчикова діаграма кількості моніторингів за підставами початку моніторингу</strong> -
          інтерактивна діаграма, що відображає кількість моніторингів, розпочатих за кожною з п’яти причин,
          визначених у Законі України “Про публічні закупівлі”. Для кожної причини кількість моніторингів
          виводиться не одним загальним числом, а поділяється на результати проведення моніторингів
          (зазначається числом та відсотком від загальної кількості моніторингів, що були розпочаті з цієї
          причини). Якщо моніторинг має декілька причин початку, то він рахується для кожної з причин.
        </li>
        <li><strong>Діаграма ТОП-6 типів порушень</strong> - інтерактивна діаграма, що відображає топ-6 типів
          порушень - за кількістю процедур, сумою очікуваних вартостей процедур чи кількістю унікальних
          замовників, в процедурах яких були виявлені такі порушення, - що знаходяться у моніторингах,
          розпочатих за обраними причиною чи причинами. За замовчуванням аналіз проводиться по всіх причинах.
        </li>
      </ol>
      Фільтри на сторінці:
      <br /><br />
      <ul className="ul-list">
        <li><strong>Фільтр вибору періоду</strong> - визначає період, для якого будується аналітика. Впливає на
          показники <strong>2</strong>, <strong>3</strong> і <strong>4</strong>.
        </li>
        <li><strong>Фільтр “Регіон замовника”</strong> - визначає регіон чи регіони України, замовники з яких
          проводили процедури закупівель, що потрапили до аналізу на цій сторінці. За замовчуванням аналітика
          будується по всіх регіонах країни. Впливає на
          показники <strong>2</strong>, <strong>3</strong> і <strong>4</strong>.
        </li>
        <li><strong>Фільтр вибору підрозділу Держаудитслужби</strong> - відбір до аналізу лише моніторингів, що
          провели аудитори з обраного/обраних підрозділів. Впливає на
          показники <strong>2</strong>, <strong>3</strong> і <strong>4</strong>.
        </li>
        <li><strong>Фільтр вибору причини початку моніторингу</strong> - відбір тільки тих моніторингів, що були
          розпочаті лише за обраною причиною. Впливає на показник <strong>4</strong>.
        </li>
      </ul>
    </div>,
    middle: '',
    bottom: '',
  },
  {
    path: '/results-by-office',
    top: <div>
      Навантаження на кожен з підрозділів Держаудитслужби може відрізнятись через різну кількість оголошень в
      різних регіонах. На цій сторінці можна переглянути дані про навантаження на кожен з підрозділів
      Держаудитслужби та результати, проведених ними моніторингів.
      <br /><br />
      <ol className="ol-list">
        <li><strong>Середня кількість порушень, виявлена підрозділами Держаудитслужби</strong> - статичний
          показник, що демонструє середню кількість виявлених порушень, що припадає на територіальний підрозділ
          Держаудитслужби за весь період аналізу.
        </li>
        <li><strong>Вартість процедур з виявленими порушеннями</strong> - інтерактивний показник, що відображає
          суму очікуваних вартостей процедур закупівель, де були виявлені порушення за обраний період.
        </li>
        <li><strong>Список територіальних підрозділів з кількістю процедур, де було встановлено порушення
          працівниками підрозділу</strong> - інтерактивний показник, що відображає кількість процедур, де було
          встановлено порушення працівниками підрозділу Держаудитслужби за обраний період.
        </li>
        <li><strong>Динаміка процедур, де було встановлено порушення працівниками підрозділу</strong> -
          інтерактивний показник, що відображає динаміку кількості процедур по місяцях обраного періоду, де було
          встановлено порушення працівниками підрозділу Держаудитслужби.
        </li>
        <li><strong>Накопичувальна динаміка</strong> - графік динаміки кількості процедур з порушеннями, суми
          очікуваних вартостей процедур, де було встановлено порушення, кількості замовників, в процедурах яких
          було встановлено порушення.
        </li>
      </ol>
      Фільтри на сторінці:
      <br /><br />
      <ul className="ul-list">
        <li><strong>Фільтр вибору періоду</strong> - визначає період, для якого будується аналітика. Впливає на
          показники <strong>2</strong>, <strong>3</strong>, <strong>4</strong> та <strong>5</strong>.
        </li>
        <li><strong>Фільтр вибору порушення</strong> - відбір показників лише за обраними видами порушень. За
          замовчанням аналітика будується по всіх видах порушень. Впливає на
          показники <strong>2</strong>, <strong>3</strong>, <strong>4</strong> та <strong>5</strong>.
        </li>
      </ul>
    </div>,
    middle: '',
    bottom: '',
  },
  {
    path: '/new-page',
    top: '',
    middle: '',
    bottom: '',
  },
]

export const MONITORING_TYPES = {
  'aboveThresholdEU': {
    name: 'Відкриті торги з публікацією англійською мовою',
    color: '#FFD600',
  },
  'aboveThresholdUA': {
    name: 'Відкриті торги',
    color: '#43E5F0',
  },
  'negotiation': {
    name: 'Переговорна процедура',
    color: '#2b82ba',
  },
  'negotiation.quick': {
    name: 'Переговорна процедура (скорочена)',
    color: '#bf2b2b',
  },
  'belowThreshold': {
    name: 'Спрощена закупівля',
    color: '',
  },
  'aboveThresholdUA.defense': {
    name: 'Переговорна процедура для потреб оборони',
    color: '',
  },
  'reporting': {
    name: 'Звіт про укладений договір',
    color: '',
  },
  'esco': {
    name: 'Відкриті торги для закупівлі енергосервісу',
    color: '',
  },
  'closeFrameworkAgreementUA': {
    name: 'Укладання рамкової угоди',
    color: '',
  },
  'closeFrameworkAgreementSelectionUA': {
    name: 'Відбір для закупівлі за рамковою угодою',
    color: '',
  },
  'competitiveDialogueEU': {
    name: 'Конкурентний діалог з публікацією англійською мовою 1-ий етап',
    color: '#bf9f2b',
  },
  'competitiveDialogueUA': {
    name: 'Конкурентний діалог 1-ий етап',
    color: '',
  },
  'competitiveDialogueEU.stage2': {
    name: 'Конкурентний діалог з публікацією англійською мовою 2-ий етап',
    color: '',
  },
  'competitiveDialogueUA.stage2': {
    name: 'Конкурентний діалог 2-ий етап',
    color: '',
  },
}

export const RESULT_MONITORING_TYPES = {
  'active': {
    name: 'Здійснення моніторингу',
    color: '#CEF1F4',
  },
  'completed': {
    name: 'Порушення виявлені',
    color: '#1E6592',
  },
  'closed': {
    name: 'Порушення не виявлені',
    color: '#3DCAD4',
  },
  // 'cancelled': {
  //   name: 'Скасовано',
  //   color: '#A8E2D1',
  // },
  // 'declined': {
  //   name: 'Порушення не виявлені',
  //   color: '#bf2b2b',
  // },
  // 'addressed': {
  //   name: 'Порушення виявлені',
  //   color: '',
  // },
  // 'stopped': {
  //   name: 'Скасовано',
  //   color: '#bf2b2b',
  // },
}

export const MONITORING_COVERAGE_LEGEND = [
  {
    groupName: 'Статус закупівлі',
    colorClass: 'blue',
    children: [
      {
        letter: 'A',
        name: 'Активні на кінець періоду',
        hidden: false,
      },
      {
        letter: 'B',
        name: 'Завершені (є контракт)',
        hidden: false,
      },
      {
        letter: 'C',
        name: 'Відмінені',
        hidden: false,
      },
    ],
  },
  {
    groupName: 'Закупівлі, для яких можна проводити моніторинг',
    colorClass: 'light-blue',
    children: [
      {
        letter: 'D',
        name: 'Усі доступні закупівлі',
        hidden: false,
      },
    ],
  },
  {
    groupName: 'Факт взяття закупівлі до моніторингу',
    colorClass: 'yellow',
    children: [
      {
        letter: 'E',
        name: 'Моніторинг ініційовано',
        hidden: false,
      },
      {
        letter: 'F',
        name: 'Моніторинг не ініційовано',
        hidden: false,
      },
    ],
  },
  {
    groupName: 'Результат моніторингу',
    colorClass: 'purple',
    children: [
      {
        letter: 'G',
        name: 'Здійснення моніторингу',
        hidden: true,
      },
      {
        letter: 'H',
        name: 'Порушення виявлені',
        hidden: false,
      },
      {
        letter: 'M',
        name: 'Порушення не виявлені',
        hidden: false,
      },
      {
        letter: 'K',
        name: 'Скасовано',
        hidden: true,
      },
    ],
  },
]

export const MORE_INFO_CAROUSEL_OPTIONS = [
  {
    logo: ImageOne,
    title: 'Територіальні підрозділи та кількість аудиторів',
    content: 'Ознайомтесь з інформацією про кількість аудиторів та їх розподіл по територіальних підрозділах.',
    buttonLink: '/resources',
  },
  {
    logo: ImageTwo,
    title: 'Порівняльна динаміка роботи аудиторів',
    content: 'Перегляньте інформацію про те, який обсяг процедур за кількістю та за сумою моніториться Держаудитслужбою за певний період.',
    buttonLink: '/comparative-dynamics',
  },
  {
    logo: ImageThree,
    // title: 'Моніторинг по ринках',
    title: 'Моніторинг за галузями',
    content: 'Ознайомтесь з розподілом моніторингів за галузями та перегляньте, яку увагу приділяє Держаудитслужба кожній з них.',
    buttonLink: '/monitoring-market',
  },
  {
    logo: ImageFour,
    title: 'Моніторинг за регіонами',
    content: 'Щоб дізнатись про розподіл моніторингів за регіонами — переходьте сюди.',
    buttonLink: '/monitoring-regions',
  },
  {
    logo: ImageFive,
    // title: 'Моніторинг по типам процедур',
    title: 'Моніторинг за типами процедур',
    content: 'Подивіться, які типи закупівель аудитори моніторять частіше, а які рідше потрапляють в їхнє поле зору ',
    buttonLink: '/monitoring-procurement-methods',
  },
  {
    logo: ImageSix,
    title: 'Покриття моніторингом',
    content: 'Перегляньте, яку частину процедур закупівель покрито моніторингом',
    buttonLink: '/monitoring-coverage',
  },
  {
    logo: ImageSeven,
    title: 'Моніторинг за тривалістю',
    content: 'Перегляньте, яка тривалість моніторингу в різних типах процедур закупівель',
    buttonLink: '/monitoring-duration',
  },
  {
    logo: ImageEight,
    title: 'Моніторинги за результатами',
    content: 'Інформація про перебіг моніторингів та їхні результати',
    buttonLink: '/monitoring-results',
  },
  {
    logo: ImageNine,
    title: 'По підрозділам держаудитслужби',
    content: 'Тут ви можете дізнатись, як працюють аудитори у вашому чи іншому регіоні.',
    buttonLink: '/results-by-office',
  },
  {
    logo: ImageTen,
    title: 'За підставами для здійснення моніторингу',
    content: 'Дізнайтесь, що слугувало підставами для проведення моніторингів та яка результативність моніторингів по кожній підставі',
    buttonLink: '/results-source',
  },
  {
    logo: ImageEleven,
    title: 'Типи порушень',
    content: 'Тут ви можете переглянути типи, кількість порушень в процедурах закупівлі, що моніторяться',
    buttonLink: '/type-of-violation',
  },
]


export const MOBILE_BAR_CHART_OPTIONS = {
  maskBullets: false,
  paddingTop: 20,
  paddingBottom: 0,
  paddingLeft: 0,
  paddingRight: 0,
  width: am4core.percent(100),
  align: 'center',
  series: [{
    type: 'ColumnSeries',
    name: '',
    clustered: false,
    // sequencedInterpolation: true,
    dataFields: {
      valueX: 'fixedValue',
      categoryY: 'category',
    },
    columns: {
      width: 30,
      height: 15,
      fill: '#ddd',
      column: {
        cornerRadiusTopLeft: 10,
        cornerRadiusTopRight: 10,
        cornerRadiusBottomRight: 10,
        cornerRadiusBottomLeft: 10,
        strokeWidth: 0,
      },
    },
    bullets: [{
      type: 'LabelBullet',
      label: {
        text: '{rightText}',
        horizontalCenter: 'right',
        dx: 0,
        dy: -20,
        hideOversized: false,
        truncate: false,
        fontFamily: 'Montserrat',
        fontSize: 13,
        fontWeight: 'bold',
      },
      locationX: 0,
    }],
  }, {
    type: 'ColumnSeries',
    name: '',
    clustered: false,
    // sequencedInterpolation: true,
    dataFields: {
      valueX: 'value',
      categoryY: 'category',
    },
    columns: {
      // width: am4core.percent(100),
      width: 30,
      height: 15,
      fill: '#3DCAD4',
      column: {
        cornerRadiusTopLeft: 10,
        cornerRadiusTopRight: 10,
        cornerRadiusBottomRight: 10,
        cornerRadiusBottomLeft: 10,
        strokeWidth: 0,
      },
    },
    bullets: [{
      type: 'LabelBullet',
      label: {
        text: '{leftText}',
        horizontalCenter: 'left',
        dx: 0,
        dy: -20,
        hideOversized: false,
        truncate: false,
        fontFamily: 'Montserrat',
        fontSize: 13,
      },
      locationX: 1,
    }],
  }],

  yAxes: [{
    type: 'CategoryAxis',
    dataFields: {
      category: 'category',
    },
    numberFormatter: {},
    renderer: {
      inversed: true,
      cellStartLocation: 0.1,
      cellEndLocation: 0.5,
      baseGrid: {
        disabled: true,
      },
      labels: {
        disabled: true,
      },
      grid: {
        location: 0,
        disabled: true,
      },
    },
  }],

  xAxes: [{
    type: 'ValueAxis',
    min: 0,
    max: 100,
    renderer: {
      opposite: true,
      baseGrid: {
        disabled: true,
      },
      labels: {
        disabled: true,
      },
      grid: {
        disabled: true,
        location: 0,
      },
    },
  }],
}

export const VIOLATION_BAR_CHART_OPTIONS = {
  height: 50,
  maskBullets: false,
  paddingTop: 0,
  paddingBottom: 0,
  paddingLeft: 0,
  paddingRight: 0,
  width: am4core.percent(100),
  align: 'center',
  series: [{
    type: 'ColumnSeries',
    name: '',
    clustered: false,
    // sequencedInterpolation: true,
    dataFields: {
      valueX: 'fixedValue',
      categoryY: 'category',
    },
    columns: {
      width: 30,
      height: 15,
      fill: '#ddd',
      column: {
        cornerRadiusTopLeft: 10,
        cornerRadiusTopRight: 10,
        cornerRadiusBottomRight: 10,
        cornerRadiusBottomLeft: 10,
        strokeWidth: 0,
      },
    },
    // bullets: [{
    //   type: 'LabelBullet',
    //   label: {
    //     text: '{rightText}',
    //     horizontalCenter: 'right',
    //     dx: 0,
    //     dy: -20,
    //     hideOversized: false,
    //     truncate: false,
    //     fontFamily: 'Montserrat',
    //     fontSize: 13,
    //     fontWeight: 'bold',
    //   },
    //   locationX: 0,
    // }],
  }, {
    type: 'ColumnSeries',
    name: '',
    clustered: false,
    // sequencedInterpolation: true,
    dataFields: {
      valueX: 'value',
      categoryY: 'category',
    },
    columns: {
      // width: am4core.percent(100),
      width: 30,
      height: 15,
      fill: '#3DCAD4',
      column: {
        cornerRadiusTopLeft: 10,
        cornerRadiusTopRight: 10,
        cornerRadiusBottomRight: 10,
        cornerRadiusBottomLeft: 10,
        strokeWidth: 0,
      },
    },
    // bullets: [{
    //   type: 'LabelBullet',
    //   label: {
    //     text: '{leftText}',
    //     horizontalCenter: 'left',
    //     dx: 0,
    //     dy: -20,
    //     hideOversized: false,
    //     truncate: false,
    //     fontFamily: 'Montserrat',
    //     fontSize: 13,
    //   },
    //   locationX: 1,
    // }],
  }],

  yAxes: [{
    type: 'CategoryAxis',
    dataFields: {
      category: 'category',
    },
    numberFormatter: {},
    renderer: {
      inversed: true,
      cellStartLocation: 0.1,
      cellEndLocation: 0.5,
      baseGrid: {
        disabled: true,
      },
      labels: {
        disabled: true,
      },
      grid: {
        location: 0,
        disabled: true,
      },
    },
  }],

  xAxes: [{
    type: 'ValueAxis',
    min: 0,
    max: 100,
    renderer: {
      opposite: true,
      baseGrid: {
        disabled: true,
      },
      labels: {
        disabled: true,
      },
      grid: {
        disabled: true,
        location: 0,
      },
    },
  }],
}

export const VIOLATIONS = [
  {
    id: 1,
    name: 'corruptionBiddingDocuments',
    realName: 'Тендерна документація складена не у відповідності до вимог закону',
  },
  {
    id: 2,
    name: 'corruptionAwarded',
    realName: 'Не відхилення тендерних пропозицій, які підлягали відхиленню відповідно до закону',
  },
  {
    id: 3,
    name: 'other',
    realName: 'Інші порушення законодавства у сфері закупівель',
  },
  {
    id: 4,
    name: 'corruptionPublicDisclosure',
    realName: 'Неоприлюднення або порушення строків оприлюднення інформації про закупівлі',
  },
  {
    id: 5,
    name: 'corruptionDescription',
    realName: 'Порушення порядку визначення предмета закупівлі',
  },
  {
    id: 6,
    name: 'documentsForm',
    realName: 'Порушення законодавства в частині складання форм документів у сфері публічних закупівель',
  },
  {
    id: 7,
    name: 'corruptionProcurementMethodType',
    realName: 'Порушення законодавства в частині неправомірного обрання та застосування процедури закупівлі',
  },
  {
    id: 8,
    name: 'corruptionCancelled',
    realName: 'Порушення законодавства в частині не відміни замовником закупівлі',
  },
  {
    id: 9,
    name: 'corruptionContracting',
    realName: 'Укладення з учасником, який став переможцем процедури закупівлі, договору про закупівлю, умови якого не відповідають вимогам тендерної документації та/або тендерної пропозиції переможця процедури закупівлі',
  },
  {
    id: 10,
    name: 'corruptionChanges',
    realName: 'Внесення змін до істотних умов договору про закупівлю у випадках, не передбачених законом',
  },
  {
    id: 11,
    name: 'corruptionFailureDocuments',
    realName: 'Ненадання інформації, документів у випадках, передбачених законом',
  },
  {
    id: 12,
    name: 'rejectionOfBidsNotByLaw',
    realName: 'Відхилення тендерних пропозицій на підставах, не передбачених законом або не у відповідності до вимог закону (безпідставне відхилення)',
  },
  {
    id: 13,
    name: 'corruptionUntimely',
    realName: 'Несвоєчасне надання або ненадання замовником роз\'яснень щодо змісту тендерної документації',
  },
  {
    id: 14,
    name: 'deadlineForThePublicationDocumentation',
    realName: 'Порушення строків оприлюднення тендерної документації',
  },
  {
    id: 15,
    name: 'corruptionConsideration',
    realName: 'Порушення строків розгляду тендерної пропозиції',
  },
  {
    id: 16,
    name: 'corruptionBidSecurity',
    realName: 'Розмір забезпечення тендерної пропозиції, встановлений у тендерній документації, перевищує межі, визначені законом',
  },
  {
    id: 17,
    name: 'servicesWithoutProcurementProcedure',
    realName: 'Придбання товарів, робіт і послуг до/без проведення процедур закупівель/спрощених закупівель відповідно до вимог закону',
  },
  {
    id: 18,
    name: 'notComplyDecisionACU',
    realName: 'Невиконання рішення Антимонопольного комітету України як органу оскарження за результатами розгляду скарг суб’єктів оскарження, подання яких передбачено законом',
  },
  {
    id: 19,
    name: 'useProceduresNotByLaw',
    realName: 'Застосування конкурентного діалогу або торгів з обмеженою участю, або переговорної процедури закупівлі на умовах, не передбачених законом',
  },
  {
    id: 20,
    name: 'contractsWithoutProcurement',
    realName: 'Укладення договорів, які передбачають оплату замовником товарів, робіт і послуг до/без проведення процедур закупівель/спрощених закупівель, визначених законом',
  },
]