import React, { useState, useEffect } from 'react'
import { Row, Col } from 'antd'
import useWidth from '../../hooks/useWidth'
import { MAX_MOBILE_WIDTH } from '../../constants'

import 'moment/locale/uk'
import { useDispatch, useSelector } from 'react-redux'
import './styles.scss'

const CalculationMethodology = () => {
  const actualDate = useSelector(state => state.currentDate)
  const [currentWidth, setCurrentWidth] = useState(window.outerWidth - 40)
  const mobile = currentWidth <= MAX_MOBILE_WIDTH
  const w = useWidth()

  useEffect(() => {
    if (currentWidth !== window.outerWidth) {
      setCurrentWidth(window.outerWidth - 40)
    }
  }, [w])

  return (
    <div className="calculation-methodology-container">
      <Row justify="center">
        <Col xs={24} sm={23} md={23} lg={23} xl={21} xxl={18} style={{ backgroundColor: '#FFFFFF' }}>
          <div className="content">
            <div className="main-title">ДАНІ, ЩО АНАЛІЗУЮТЬСЯ У ДОДАТКУ</div>
            <div className="list-item">
              <div className="list-item-number">1.</div>
              <div className="list-item-text">Відбір процедур та моніторингів. Вибірка.</div>
            </div>
            <div className="text-header">Період проведення моніторингу (тривалість моніторингу)</div>
            <div className="text-content">Час проведення моніторингу визначається як кількість днів від дати публікації
              наказу про початок моніторингу до дати публікації висновку про результати моніторингу процедури закупівлі
              та не може перевищувати 15 робочих днів.
            </div>
            <div className="text-header">Віднесення моніторингу до періоду</div>
            <div className="text-content">Моніторинги відносяться до певного періоду на основі дати публікації висновку
              про
              результати моніторингу.
            </div>
            <div className="text-header">Відбір моніторингів</div>
            <div className="text-content">Виведення показників реалізоване за фіксовані періоди довжиною в один рік
              кожен, починаючи з 1 січня 2019 року.
            </div>
            <div className="text-header">Період проведення процедури</div>
            <div className="text-content">Процедура вважатиметься активною з моменту її оголошення в системі закупівель
              до завершення чи розірвання усіх контрактів, що були підписані внаслідок проведення цієї процедури.
            </div>
            <div className="text-header">Віднесення процедури закупівлі до періоду</div>
            <div className="text-content">Процедури закупівель відносяться до певного періоду за датою їхнього
              оголошення. Наприклад, до 2019 року будуть віднесені всі процедури, що були оголошені у 2019 році.
            </div>
            {/*<div className="text-header">Нульовий період</div>*/}
            {/*<div className="text-content">Як зазначено вище, весь час аналізу в додатку розпочинається з 2019 року.*/}
            {/*  Проте, частину моніторингів, що проводилися після початку 2019 року, було ініційовано на процедури*/}
            {/*  закупівель, що розпочались раніше 1 січня 2019 року. Не врахувати їх було б не правильним, адже вони*/}
            {/*  проводились в аналітичному періоді, на них було затрачено час та ресурси Держаудитслужби і вони мали*/}
            {/*  певний результат. Тож для таких моніторингів ми вводимо поняття “нульового періоду”, як періоду аналізу*/}
            {/*  процедур закупівель, що розпочались раніше за 1 січня 2019 року. Він не буде присутній на дашбордах у*/}
            {/*  явному вигляді, тобто його не можна буде обрати окремо для перегляду показників, але він необхідний для*/}
            {/*  коректного віднесення результатів роботи аудиторів в межах проведення моніторингів.*/}
            {/*</div>*/}
            {/*<div className="text-header">Періоди аналізу</div>*/}
            {/*<div className="text-content">Одна з головних цілей реалізованої аналітики полягає в тому, щоб показати*/}
            {/*  користувачу процес моніторингу під різними кутами зору, надати йому змогу оцінити стан речей за різними*/}
            {/*  показниками та побачити динаміку змін цих показників в часі. Обрані показники повинні допомогти описати*/}
            {/*  стан процесу моніторингу процедур закупівель в Україні загалом. Водночас потрібно розуміти, що таким*/}
            {/*  аналітичним показникам не властиво змінюватися швидко, а тому проведення оцінки їхньої динаміки в розрізі*/}
            {/*  тижнів, місяців чи навіть кварталів не є доцільним. Зважаючи на це, усі аналітичні періоди, реалізовані у*/}
            {/*  додатку, тривалістю один рік.*/}
            {/*</div>*/}
            {/*<div className="text-header">Покриття моніторингами</div>*/}
            {/*<div className="text-content">Поняття «покриття моніторингами» в межах цього аналітичного додатку - це*/}
            {/*  відсоток кількості процедур або відсоток сум очікуваних вартостей процедур, що були оголошені в періоді та*/}
            {/*  потрапили під моніторинг до .загальної кількості або суми очікуваних вартостей процедур, що були оголошені*/}
            {/*  в періоді.*/}
            {/*</div>*/}
            <div className="list-item">
              <div className="list-item-number">2.</div>
              <div className="list-item-text">Процедури, що включаються до аналітики</div>
            </div>
            <div className="text-header">Типи процедур</div>
            <div className="text-content">Для розрахунку аналітичних показників використовуються процедури закупівель
              семи типів:
              <ul className="ul-list">
                <li>Відкриті торги;</li>
                <li>Відкриті торги з публікацією англійською мовою;</li>
                <li>Переговорні процедури;</li>
                <li>Переговорні прискорені процедури;</li>
                <li>Переговорні процедури для потреб оборони;</li>
                <li>Рамкові угоди;</li>
                <li>Конкурентні діалоги.</li>
              </ul>
              Надалі, коли мова йтиме про процедури закупівель, матимуться на увазі закупівельні процедури саме цих
              типів.
            </div>
            <div className="text-header">Статуси процедур</div>
            <div className="text-content">Для цілей аналітики беруться до уваги активні процедури — тобто ті, що
              тривають, а також завершені та відмінені. Крім того, до аналітики включені “покинуті” процедури.
              “Покинутою” процедурою вважається така процедура закупівлі, що не змінювалась протягом 180 днів, адже такі
              процедури також підпадають під моніторинг.
            </div>
            {/*<div className="text-content">Окрім*/}
            {/*  того, до аналітики включені “покинуті” процедури. “Покинутою” процедурою вважатимемо таку процедуру*/}
            {/*  закупівлі, що не змінювалась протягом 180 днів, адже такі процедури також попадають під моніторинг.*/}
            {/*</div>*/}
            {/*<div className="list-item">*/}
            {/*  <div className="list-item-number">3.</div>*/}
            {/*  <div className="list-item-text">Процедури з недостовірними даними</div>*/}
            {/*</div>*/}
            {/*<div className="text-content">Оскільки в системі Prozorro не реалізований достатній контроль даних, що*/}
            {/*  вводяться учасниками закупівель вручну, помилки при введенні можуть суттєво впливати на деякі аналітичні*/}
            {/*  показники, наприклад, помилкове введення очікуваної вартості процедури. З метою виключення з розрахунків*/}
            {/*  таких процедур уповноваженим представникам Держаудитслужби нададуть можливість вводити ідентифікатори*/}
            {/*  окремих процедур, що мають бути виключені з розрахунків.*/}
            {/*</div>*/}
            <div className="list-item">
              <div className="list-item-number">3.</div>
              <div className="list-item-text">Розрахунок вартості процедури</div>
            </div>
            <div className="text-content">Оскільки аудитори працюють з процедурами, що знаходяться в активній фазі, вони
              не можуть знати фактичної вартості закупівлі, а тому для відбору мають можливість керуватися лише
              очікуваною вартістю процедури. Саме тому в аналітичному інструменті вартістю процедури вважається
              очікувана вартість, що вказана замовником при оголошенні процедури.
            </div>
            <div className="list-item">
              <div className="list-item-number">4.</div>
              <div className="list-item-text">Визначення аудитора, що проводив моніторинг</div>
            </div>
            <div className="text-content">На даний момент з API моніторингів можна визначити аудитора, що проводив
              моніторинг, як аудитора, що опублікував висновок про результати моніторингу процедури закупівлі. Отже,
              визначення аудиторів, що проводили моніторинги, а також розрахунок показників щодо кількості порушень,
              здійснюватиметься на тих моніторингах, що вже мають опубліковані висновки.
            </div>
            <div className="sub-main-text">ПОКАЗНИКИ ТА ЇХНІЙ РОЗРАХУНОК</div>
            <div className="text-content">Тематично всі показники в аналітичному додатку можна поділити на три групи:
              <ul className="ul-list">
                <li><strong>Ресурсні</strong> - це показники, що надають інформацію про наявні ресурси у системі
                  моніторингу закупівель;
                </li>
                <li><strong>Процесні</strong> - показники, що описують процес проведення моніторингів;</li>
                <li><strong>Результатні</strong> - використовуються для описання результатів моніторингу.</li>
              </ul>
              За періодом розрахунку показники можна розділити на:
              <ul className="ul-list">
                <li>Показники, що рахуються за весь час проведення аналізу;</li>
                <li>Показники, що рахуються за обраний користувачем період.</li>
              </ul>
              Усі доступні для вибору періоди мають довжину один або два роки. Для користувача доступні наступні
              періоди:
              <ul className="ul-list">
                <li><strong>Завершений повний календарний рік</strong> - можна вибрати будь-який календарний рік, що
                  завершився на момент перебування користувача у додатку, починаючи з 2019 року;
                </li>
                <li><strong>Останні 12 місяців</strong> - період, що охоплює останні повні 12 місяців на поточний день;
                </li>
                <li><strong>Останні 24 місяці</strong> - період, що охоплює останні повні 24 місяці на поточний день.
                </li>
              </ul>
              У період включені ті моніторинги, дата початку яких належить саме до цього періоду.
              <br />
              <br />
              За інтерактивністю показники можна поділити на:
              <ul className="ul-list">
                <li><strong>Статичні</strong> - показники, що не змінюються протягом сеансу користувача в додатку;</li>
                <li><strong>Інтерактивні</strong> - показники, що автоматично перераховуються внаслідок взаємодії
                  користувача з інтерактивними елементами сторінки: фільтрами, графічними елементами керування тощо.
                </li>
              </ul>
            </div>
            <div className="sub-main-text">АНАЛІТИЧНІ ПОКАЗНИКИ, ЩО ВИКОРИСТОВУЮТЬСЯ НА СТОРІНКАХ ДОДАТКА</div>
            <div className="text-header">ПОКАЗНИКИ ГОЛОВНОЇ СТОРІНКИ</div>
            <div className="text-content">
              На стартовій сторінці відображаються такі показники:
              <ol className="ol-list">
                <li><strong>Вартість процедур закупівель, щодо яких Держаудитслужба провела моніторинг з січня 2019
                  року</strong> - статичний процесний показник за весь час аналізу, що відображає суму очікуваних
                  вартостей процедур, на які було розпочато моніторинг.
                </li>
                <li><strong>Хто найбільше порушував</strong> - при кожній новій сесії роботи з аналітичним інтерфейсом з
                  таблиці за весь період випадковим чином вибирається 20 замовників, в процедурах яких, в результаті
                  моніторингів, були виявлені порушення. Інформація, що відображається включає код ЄДРПОУ та назву
                  замовника, а також суму очікуваних вартостей його процедур з порушенням. Розраховується для
                  замовників, очікувана вартість процедур з порушенням яких становить понад 10 млн. грн.
                </li>
                <li><strong>Процедур перевірено</strong> - показник за весь період, що відображає кількість процедур, на
                  які було завершено моніторинг.
                </li>
                <li><strong>Процедур перевірено (динаміка за останні 24 місяці)</strong> - статичний процесний показник
                  за останні 24 місяці, що помісячно відображає кількість процедур, на які було завершено моніторинг.
                </li>
                <li><strong>Процедур з порушеннями</strong> - статичний результатний показник за весь період, що
                  відображає кількість процедур, у яких в результаті моніторингу було виявлено порушення.
                </li>
                <li><strong>Кількість процедур з порушеннями (динаміка за останні 24 місяці)</strong> - статичний
                  результатний показник за останні 24 місяці, що відображає кількість процедур, у яких в результаті
                  моніторингу було виявлено порушення.
                </li>
                <li><strong>Замовників перевірено</strong> - статичний процесний показник за весь час, що відображає
                  кількість унікальних замовників (конкатенація кода ЄДРПОУ та назви замовника), хоча б одну процедуру
                  яких було взято у моніторинг.
                </li>
                <li><strong>Замовників з порушенням</strong> - статичний результатний показник за весь час, що
                  відображає кількість унікальних замовників (конкатенація кода ЄДРПОУ та назви замовника), у процедурах
                  яких було знайдено хоча б одне порушення.
                </li>
              </ol>
            </div>
            <div className="text-header">СТОРІНКА “РЕСУРСИ - ТЕРИТОРІАЛЬНІ ПІДРОЗДІЛИ ТА КІЛЬКІСТЬ АУДИТОРІВ”</div>
            <div className="text-content">На цій сторінці відображаються наступні показники:
              <ol className="ol-list">
                <li>
                  <strong>Загальна кількість аудиторів, які проводили моніторинги</strong> - це кількість аудиторів, що
                  провели хоча б один моніторинг за весь час аналізу. Підрахунок ведеться за даними електронних підписів
                  аудиторів, що зберігає система під час проведення моніторингів.
                  {/*<br />*/}
                  {/*<br />*/}
                  {/*<strong>Складності підрахунку та ухвалені рішення: </strong> наразі в АРІ Прозорро є складність, що не*/}
                  {/*дозволяє точно прив’язати аудитора, що робив якісь дії для запуску/ведення моніторингу, до публікації*/}
                  {/*висновку. Отож, оскільки точно визначити усю кількість аудиторів, що брали участь в моніторингу*/}
                  {/*закупівлі наразі змоги немає, для потреб аналітики ми визначатимемо аудитора, як особу, що робила*/}
                  {/*останню за хронологією публікацію чогось в межах моніторингу.*/}
                </li>
                <li>
                  <strong>Кількість аудиторів, які здійснювали моніторинг у відповідному періоді</strong> - це кількість
                  аудиторів, що провели хоча б один моніторинг в обраному періоді. Підрахунок ведеться за даними
                  електронних підписів аудиторів, що зберігає система під час проведення моніторингів.
                  {/*<br />*/}
                  {/*<br />*/}
                  {/*<strong>Складності підрахунку та ухвалені рішення:</strong> див. пункт 1.*/}
                </li>
                <li>
                  <strong>Розподіл аудиторів, що проводили моніторинги по регіональних підрозділах Держаудитслужби
                    (мапа)</strong> - кількість аудиторів, що провели хоча б один моніторинг у періоді, що розподілені
                  по територіальних підрозділах Держаудитслужби. Підрахунок та розподіл ведеться за даними електронних
                  підписів аудиторів, що зберігає система під час проведення моніторингів.
                  {/*<br />*/}
                  {/*<br />*/}
                  {/*<strong>Складності підрахунку та ухвалені рішення:</strong> див. пункт 1.*/}
                </li>
                <li>
                  <strong>Кількість аудиторів, що проводили моніторинги (лінійний графік)</strong> - кількість
                  аудиторів, що провели хоча б один моніторинг по місяцях обраного періоду та розподілені по
                  територіальних підрозділах Держаудитслужби (якщо на мапі обрані окремі підрозділи). Підрахунок та
                  розподіл ведеться за даними електронних підписів аудиторів, що зберігає система під час проведення
                  моніторингів.
                </li>
              </ol>
              <div className="filters-text">Фільтри на сторінці:</div>
              <ul className="ul-list">
                <li><strong>Фільтр вибору періоду</strong> - визначає період, для якого будується аналітика. Впливає на
                  показники <strong>2</strong>, <strong>3</strong> та <strong>4</strong>.
                </li>
                <li><strong>Фільтр за територіальним підрозділом Держаудитслужби</strong> - визначає
                  підрозділ/підрозділи для аналізу (фільтрація за допомогою вибору на мапі). За замовчуванням обрані всі
                  підрозділи. Впливає на показники <strong>2</strong> та <strong>4</strong>.
                </li>
              </ul>
            </div>
            <div className="text-header">СТОРІНКА “ПОРІВНЯЛЬНА ДИНАМІКА РОБОТИ АУДИТОРІВ”</div>
            <div className="text-content">Сторінка призначена для аналізу навантаження на аудиторів. Відображаються
              наступні показники:
              <ol className="ol-list">
                <li><strong>Охоплено процедур закупівель моніторингами</strong> - статичний показник, що показує, щодо
                  якої кількості процедур було проведено моніторинг за весь час аналізу.
                </li>
                <li><strong>Охоплено процедур закупівель моніторингами за обраний період за вартістю</strong> -
                  динамічний показник, що розраховується як відсоток суми процедур, оголошених в періоді, щодо яких було
                  проведено моніторинг від суми усіх процедур, що були оголошені в періоді.
                </li>
                <li><strong>Лінійний графік продуктивності аудиторів</strong> - складається з трьох лінійних діаграм:
                  <ul className="ul-list">
                    <li><strong>Кількість процедур (сума процедур)</strong> - кількість процедур (сума очікуваних
                      вартостей процедур), щодо яких проведено моніторинг. Відображається помісячно для кожного місяця
                      обраного періоду.
                    </li>
                    <li><strong>Кількість аудиторів</strong> - кількість унікальних аудиторів, що проводили моніторинги
                      в цей місяць обраного періоду.
                    </li>
                    <li><strong>Продуктивність аудиторів</strong> - середнє навантаження на одного аудитора, що
                      розраховується як відношення кількості процедур (суми очікуваних вартостей процедур), щодо яких
                      проведено моніторинг, до кількості аудиторів, які проводили моніторинги. Розраховується для
                      кожного місяця обраного періоду.
                    </li>
                  </ul>
                  <strong>Примітка:</strong> при наведенні на графіку на місяць, відповідні значення відображаються в
                  правому верхньому куті кожної діаграми.
                </li>
              </ol>
              <div className="filters-text">Фільтри на сторінці:</div>
              <ul className="ul-list">
                <li><strong>Фільтр вибору періоду</strong> - визначає період, для якого будується аналітика. Впливає на
                  показники <strong>2</strong> та <strong>3</strong>.
                </li>
              </ul>
            </div>
            <div className="text-header">СТОРІНКА “МОНІТОРИНГ ЗА ГАЛУЗЯМИ”</div>
            <div className="text-content">Сторінка призначена для ознайомлення з галузевим розподілом моніторингів.
              Користувач має змогу побачити ті галузі та їхні окремі ніші, де концентрується найбільша кількість
              порушень або вага порушень є найвищою (за сумою процедур закупівель). За Законом “Про публічні закупівлі”
              замовник для кожного предмету закупівлі має вказати код цього предмету закупівлі з Єдиного Закупівельного
              Словника (ЄЗС), розкривши його до 4-го знаку. Галузевий аналіз на цій аналітичній сторінці був
              побудований, базуючись саме на структурі ЄЗС.
            </div>
            <div className="text-content">Кожен код предмету з ЄЗС складається з 9 цифр. Словник має ієрархічну
              структуру, тож цифри коду зліва показують приналежність предмету закупівлі до певної групи. Для
              аналітичних графіків використовується наступний поділ:
              <ul className="ul-list">
                <li><strong>Перші дві цифри коду визначають розділ</strong> - саме розділи словника використовуються як
                  найбільш загальний поділ усіх предметів закупівель на галузі економіки (всього таких розділів в ЄЗС
                  46);
                </li>
                <li><strong>Перші 3 цифри коду визначають групу предметів закупівель</strong> - другий рівень
                  деталізації предметів закупівель (всього таких груп в ЄЗС 273);
                </li>
                <li><strong>Перші 4 цифри коду визначають клас предмету закупівлі</strong> - третій і останній рівні
                  деталізації предметів закупівель на сторінці (всього класів в ЄЗС 1 006).
                </li>
              </ul>
              До аналізу відібрані лише ті процедури, де вказано тип предмету закупівлі: товари, роботи чи послуги.
              <br />
              <br />
              Відображаються наступні показники:
              <ol className="ol-list">
                <li><strong>Загальна кількість номенклатур, що потрапляла під моніторинг</strong> - статичний показник,
                  що показує загальну кількість вказаних замовниками кодів (оригінальні коди, що вказані замовниками у
                  процедурах закупівель, без жодної корекції) предметів закупівель у процедурах, щодо яких було
                  проведено моніторинг за весь період аналізу.
                </li>
                <li><strong>Розділи Єдиного Закупівельного Словника, що потрапляли під моніторинг</strong> - динамічний
                  показник, що відображає кількість розділів ЄЗС предмети закупівель, з яких були присутні у процедурах
                  закупівель, щодо яких було проведено моніторинг.
                </li>
                <li><strong>Список розділів ЄЗС з кількістю (сумою очікуваних вартостей) процедур</strong> - це
                  динамічний показник-список, що відображає назву розділу ЄЗС, його код (перші 2 цифри в коді предмету
                  закупівлі) та загальну кількість (суму очікуваних вартостей) процедур, щодо яких було проведено
                  моніторинг.
                </li>
                <li><strong>Динаміка моніторингів процедур, у яких коди предметів закупівель належать до визначеного
                  розділу</strong> - це лінійна діаграма, що залежна від елемента списку попереднього показника.
                  Користувач має змогу отримати розподіл за місяцями обраного періоду для кожного елемента списку
                  попереднього показника.
                </li>
                <li><strong>Групи та класи предметів закупівель, що найчастіше потрапляли під моніторинг</strong> - це
                  інтерактивна бульбашкова діаграма, що побудована за ієрархічним принципом, де найвищий рівень являє
                  собою тип предмету закупівлі: товари, послуги чи роботи; наступний рівень, що відкривається і
                  закривається при натисканні на відповідну бульбашку - це розділи ЄЗС, предмети закупівель, з яких
                  найчастіше опинялися у процедурах з моніторингом (на графіку виводиться ТОП-5 розділів за
                  кількістю/очікуваною вартістю). При натисканні на бульбашку розділу ЄЗС користувачу пропонується
                  наступний рівень ієрархії - ТОП-5 груп ЄЗС, що належать до обраного розділу, предмети закупівель яких
                  найчастіше опинялись у процедурах з моніторингом. І, нарешті, обрана група ЄЗС розкривається до ТОП-5
                  класів з цієї групи, предмети закупівель з яких найчастіше опинялись у процедурах з моніторингом.
                  <br />
                  <br />
                  <strong>Відображення показників на бульбашках:</strong> на кожній бульбашці за замовчуванням
                  відображається показник у відсотках. Цей показник відображає відсоткове співвідношення тих предметів
                  закупівель (за кількість/сумою очікуваних вартостей процедур), що входять у поточну бульбашку до
                  кількості предметів закупівель (за кількість/сумою очікуваних вартостей процедур) з батьківської
                  бульбашки. Так отримуємо такі рівні ієрархії:
                  <ul className="ul-list">
                    <li><strong>Верхній рівень</strong> - Товари/Послуги/Роботи: ці кульки не мають батьківських, тож на
                      них відображається частка за кількістю/сумою очікуваних вартостей усіх процедур, що потрапили під
                      моніторинг;
                    </li>
                    <li><strong>Рівень розділів</strong> - бульбашки з назвами розділів, у яких відображається частка за
                      кількістю/сумою очікуваних вартостей усіх процедур з предметами закупівель цього розділу від
                      кількості/суми очікуваних вартостей процедур з моніторингом, що мали такий самий тип предмету
                      закупівлі (Товари/Послуги/Роботи).
                    </li>
                    <li>
                      <strong>Рівень групи</strong>
                      - відсоток процедур (кількість/вартість) з моніторингом цієї групи від усіх процедур з розділу, до
                      якого належить група;
                    </li>
                    <li>
                      <strong>Рівень класу</strong>
                      - відсоток процедур (кількість/вартість) з моніторингом цього класу від усіх процедур з групи, до
                      якої належить клас.
                    </li>
                  </ul>
                </li>
              </ol>
              <div className="filters-text">Фільтри на сторінці:</div>
              <ul className="ul-list">
                <li><strong>Фільтр вибору періоду</strong> - визначає період, для якого будується аналітика. Впливає
                  на показники <strong>2</strong>, <strong>3</strong>, <strong>4</strong>, та <strong>5</strong>.
                </li>
                <li><strong>Фільтр “Замовники за регіонами”</strong> - визначає регіон чи регіони території України,
                  замовники з яких проводили процедури закупівель. За замовчуванням аналітика будується по всіх
                  регіонах країни разом.
                </li>
              </ul>
            </div>
            <div className="text-header">СТОРІНКА “МОНІТОРИНГ ЗА РЕГІОНАМИ”</div>
            <div className="text-content">Сторінка відображає територіальний розподіл моніторингів. Оскільки кожен
              замовник, що проводить процедуру закупівлі, розташований в певному регіоні країни, дуже важливо мати
              уявлення, скільки замовників потрапило під контроль у різних регіонах України.
              <ol className="ol-list">
                <li>
                  <strong>Замовники, що проводили процедури закупівель</strong>
                  - це загальна кількість замовників, що провели хоча б одну процедуру закупівлі за весь час аналізу.
                </li>
                <li><strong>Кількість замовників, процедури яких моніторили аудитори</strong> - кількість унікальних
                  замовників, процедури яких хоч раз попадали під моніторинг в обраному періоді.
                </li>
                <li><strong>Мапа замовників, процедури яких потрапляли під моніторинг аудиторів</strong> -
                  територіальний розподіл унікальних замовників, процедури яких хоча б раз попадали під моніторинг в
                  обраному періоді.
                </li>
                <li><strong>Сума процедур з моніторингом</strong> - стовпчикова діаграма, що відображає п'ятірку
                  найкращих розділів ЄЗС, предмети закупівель з яких найчастіше опинялись в процедурах з моніторингами.
                  Рахується як частка процедур з моніторингами з предметами закупівель з розділу від усіх процедур з
                  моніторингами (відсоток за кількістю або за сумою очікуваних вартостей процедур).
                </li>
              </ol>
              <div className="filters-text">Фільтри на сторінці:</div>
              <ul className="ul-list">
                <li><strong>Фільтр вибору періоду</strong> - визначає період, для якого будується аналітика. Впливає на
                  показники <strong>2</strong>, <strong>3</strong> та <strong>4</strong>.
                </li>
                <li><strong>Фільтр “Замовники за регіонами”</strong> (відбір регіонів на мапі) - визначає регіон чи
                  регіони України, замовники з яких проводили процедури закупівель. За замовчуванням аналітика будується
                  по всіх регіонах країни.
                </li>
                <li><strong>Фільтр “Територіальний підрозділ Держаудитслужби”</strong> - дозволяє проводити відбір лише
                  тих замовників та їхніх процедур закупівель, моніторинги на які проводили співробітники обраних
                  територіальних підрозділів Держаудитслужби. За замовчуванням аналітика будується на моніторингах усіх
                  підрозділів.
                </li>
              </ul>
            </div>
            <div className="text-header">СТОРІНКА “МОНІТОРИНГ ЗА ТИПАМИ ПРОЦЕДУР”</div>
            <div className="text-content">Сторінка містить показники, щодо типів закупівельних процедур.
              <ol className="ol-list">
                <li><strong>Охоплено замовників моніторингами</strong> - статичний показник, що відображає кількість
                  унікальних замовників, хоча б одна процедура яких потрапляла під моніторинг за весь час аналізу.
                </li>
                <li><strong>Процедури закупівель, по яких проведено моніторинг</strong> - інтерактивний показник, що
                  відображає кількість процедур, щодо яких проведено моніторинг у обраному періоді.
                </li>
                <li><strong>Розподіл процедур, що потрапили під моніторинг за типами</strong> - інтерактивна кругова
                  діаграма, що відображає відсотки (за кількістю або сумою очікуваних вартостей) процедур, що потрапляли
                  під моніторинг за їхніми типами у обраному періоді.
                </li>
                <li><strong>Охоплено моніторингом</strong> - інтерактивний показник, що відображає кількість/суму
                  очікуваних вартостей процедур, що охоплені моніторингом у обраному періоді.
                </li>
                <li><strong>Охоплено замовників</strong> - інтерактивний показник, що відображає кількість унікальних
                  замовників, хоча б одна процедура яких потрапляла під моніторинг у обраному періоді.
                </li>
                <li><strong>Динаміка кількості (суми очікуваних вартостей) моніторингів</strong> (лінійна діаграма) -
                  інтерактивна лінійна діаграма, що відображає кількість/суму очікуваних вартостей процедур, що охоплені
                  моніторингом помісячно у обраному періоді.
                </li>
              </ol>
              <div className="filters-text">Фільтри на сторінці:</div>
              <ul className="ul-list">
                <li><strong>Фільтр вибору періоду</strong> - визначає період, для якого будується аналітика. Впливає на
                  показники <strong>2</strong>, <strong>3</strong> , <strong>4</strong> , <strong>5</strong> та <strong>6</strong>.
                </li>
                <li><strong>Фільтр “Регіон замовника”</strong> - визначає регіон чи регіони України, замовники з яких
                  проводили процедури закупівель, що потрапили під моніторинг. За замовчуванням аналітика будується по
                  всіх регіонах країни.
                </li>
              </ul>
            </div>
            <div className="text-header">СТОРІНКА “МОНІТОРИНГ ЗА ТРИВАЛІСТЮ”</div>
            <div className="text-content">
              Ця аналітична сторінка відображає ще один важливий аспект моніторингового контролю - терміни виконання.
              <ol className="ol-list">
                <li><strong>Загальний час, затрачений на моніторинги</strong> - статичний показник, що відображає
                  кількість днів, що були затрачені на проведення моніторингів за весь період аналізу.
                  <br />
                  <br />
                  <strong>Складності підрахунку та ухвалені рішення: </strong>аудитори проводять по декілька
                  моніторингів одночасно та не витрачають на кожен моніторинг весь свій робочий час. Проте наразі не
                  існує цифрової системи, де б аудитори відображали дані щодо того, скільки саме часу вони витрачали на
                  роботу в межах кожного моніторингу. Отже, для цілей аналітики час, що затрачений на моніторинг - це
                  кількість днів від початку моніторингу до публікації висновку про результати моніторингу.
                </li>
                <li><strong>Час, затрачений на моніторинги</strong> - інтерактивний показник, що відображає кількість
                  днів, що були затрачені на проведення моніторингів за обраний період.
                </li>
                <li><strong>Середня тривалість моніторингу по видах процедур</strong> - інтерактивний показник, що
                  відображає середній час, який витрачається на проведення моніторингу залежно від типу конкурентності
                  процедури. Окремо виводяться показники по конкурентних і неконкурентних процедурах в обраному періоді.
                </li>
                <li><strong>Середня тривалість моніторингу по підрозділах Держаудитслужби</strong> (мапа) - інтерактивні
                  показники на мапі, що відображають середній час, що затрачається на проведення моніторингу у різних
                  підрозділах Держаудитслужби в обраному періоді.
                </li>
                <li><strong>Діаграма розмаху тривалості моніторингів по кожному типу процедур закупівель</strong> -
                  інтерактивна діаграма, що відображає розмах тривалостей моніторингів (від найкоротшого до найдовшого)
                  по кожному типу процедур закупівель в обраному періоді.
                </li>
              </ol>
              <div className="filters-text">Фільтри на сторінці:</div>
              <ul className="ul-list">
                <li><strong>Фільтр вибору періоду</strong> - визначає період, для якого будується аналітика. Впливає на
                  показники <strong>2</strong>, <strong>3</strong> , <strong>4</strong> та <strong>5</strong>.
                </li>
                <li><strong>Фільтр “Територіальний підрозділ Держаудитслужби”</strong> (відбір на мапі) - показники
                  розраховуються лише на тих моніторингах, які проводили співробітники обраних територіальних
                  підрозділів Держаудитслужби. За замовчуванням аналітика будується на моніторингах усіх підрозділів.
                  Впливає на показники <strong>2</strong> , <strong>3</strong> та <strong>5</strong>
                  всіх регіонах країни.
                </li>
              </ul>
            </div>
            <div className="text-header">СТОРІНКА “ПОКРИТТЯ МОНІТОРИНГОМ”</div>
            <div className="text-content">
              На цій сторінці представлена інформація щодо охоплення закупівельних процедур моніторингами. Аналітика
              дозволяє побачити, яка частина з усіх оголошених у періоді закупівель потрапляє під моніторинг
              Держаудитслужби. Для порівняння на цій сторінці виведені два типи грошових показників - сума очікуваних
              вартостей та сума пропозицій переможців. У чому ж різниця і навіщо два показники?
              <br />
              <br />
              <i>Очікувана вартість процедури</i> - це оціночна вартість закупівлі, визначена замовником до початку
              проведення
              торгів. У конкурентних процедурах закупівель ця сума також виступає як верхня межа, що замовник може
              сплатити в межах закупівлі.
              <br />
              <br />
              <i>Сума пропозиції переможця</i> - це вартість пропозиції учасника торгів, що визнана найкращою, і на
              основі цієї
              пропозиції замовник планує укладати договір з цим учасником.
              <br />
              <br />
              Для побудови цієї аналітики беруться до уваги лише суми пропозицій переможців для завершених процедур
              закупівель, тобто тих, що завершилися підписанням договору з постачальником. Очікувану вартість мають усі
              процедури: завершені, відмінені та ті, що ще тривають. Отож, наявність на сторінці показника “сума
              пропозицій переможців” дає можливість порівняти, на яку суму планують закупити Товари/Послуги/Роботи та
              проводять закупівлі, та суму, що фактично витрачають на Товари/Послуги/Роботи у обраному періоді.
              <ol className="ol-list">
                <li><strong>Загальна вартість пропозицій переможців</strong> - це статичний показник, що відображає
                  загальну суму пропозицій переможців у завершених процедурах закупівель за весь час аналізу.
                </li>
                <li><strong>Загальна вартість пропозицій переможців</strong> за період - інтерактивний показник, що
                  відображає загальну суму пропозицій переможців у завершених процедурах закупівель за обраний період.
                </li>
                <li><strong>Потокова діаграма покриття моніторингами процедур закупівель</strong> - діаграма, що
                  дозволяє користувачу скласти уявлення про покриття (за кількістю/сумою очікуваних вартостей)
                  моніторингами процедур закупівель у обраному періоді. “Статуси закупівлі” -
                  вершини <strong>А</strong> (активні процедури), <strong>B</strong> (завершені процедури)
                  та <strong>C</strong> (відмінені процедури) - формують вершину <strong>D</strong> “Закупівлі, для яких
                  можна проводити моніторинг”, що являє собою сукупність усіх процедур, що були оголошені в обраному
                  періоді та є чи були під контролем Держаудитслужби.
                  <br />
                  <br />
                  Так само усі процедури з вершини <strong>D</strong> далі по факту взяття закупівлі до моніторингу
                  розділяються на ті, щодо яких проведено моніторинг (вершина <strong>Е</strong>) та на ті, щодо яких
                  моніторинг не проводився (вершина <strong>F</strong>). І нарешті ті процедури, щодо яких проведено
                  моніторинг, поділяються по результату моніторингу на ті, де були виявлені порушення
                  (вершина <strong>G</strong>) та ті, де порушень не було виявлено (вершина <strong>H</strong>).
                </li>
              </ol>
              <div className="filters-text">Фільтри на сторінці:</div>
              <ul className="ul-list">
                <li><strong>Фільтр вибору періоду</strong> - визначає період, для якого будується аналітика. Впливає на
                  показники <strong>2</strong> та <strong>3</strong>.
                </li>
              </ul>
            </div>
            <div className="text-header">СТОРІНКА “МОНІТОРИНГИ ЗА РЕЗУЛЬТАТАМИ”</div>
            <div className="text-content">
              Сторінка створена, щоб користувач зміг оцінити результати проведення моніторингів.
              <ol className="ol-list">
                <li><strong>Загальна сума процедур, що потрапили під моніторинг</strong> - це статичний показник, що
                  відображає загальну суму очікуваних вартостей процедур закупівель, що потрапили під моніторинг за весь
                  час аналізу.
                </li>
                <li><strong>Кількість процедур з моніторингами за період</strong> - інтерактивний показник, що
                  відображає кількість процедур, щодо яких було проведено моніторинг в обраному періоді.
                </li>
                <li><strong>Кількість (сума очікуваних вартостей) процедур з моніторингами за період</strong> (мапа) -
                  інтерактивна мапа, що відображає кількість (суму очікуваних вартостей) процедур, щодо яких було
                  проведено моніторинг в обраному періоді. Територіальний розподіл зроблено за регіонами замовників, що
                  проводили закупівлі.
                </li>
                <li><strong>Кругова діаграма результатів моніторингів</strong> - інтерактивна діаграма, що відображає
                  відсоткові частки за кількістю (сумою очікуваних вартостей процедур) результатів завершених
                  моніторингів в обраному періоді.
                </li>
                <li><strong>Динаміка результатів моніторингів за кількістю (сумою очікуваних вартостей процедур з
                  моніторингами) по місяцях обраного періоду</strong> - інтерактивна мапа, що відображає кількість (суму
                  очікуваних вартостей) процедур, щодо яких був проведений моніторинг в обраному періоді. Територіальний
                  розподіл зроблено за регіонами замовників, що проводили закупівлі
                </li>
              </ol>
              <div className="filters-text">Фільтри на сторінці:</div>
              <ul className="ul-list">
                <li><strong>Фільтр вибору періоду</strong> - визначає період, для якого будується аналітика. Впливає на
                  показники <strong>2</strong>, <strong>3</strong>, <strong>4</strong> та <strong>5</strong>.
                </li>
              </ul>
            </div>
            <div className="text-header">СТОРІНКА “ТИПИ ПОРУШЕНЬ”</div>
            <div className="text-content">
              Ця аналітична сторінка служить для аналізу даних щодо виявлених порушень в процедурах закупівель у процесі
              моніторингу.
              <ol className="ol-list">
                <li><strong>Загальна кількість замовників, що порушували</strong> - статичний показник, що відображає
                  кількість унікальних замовників, у процедурах закупівель яких в процесі моніторингів було знайдено
                  хоча б одне порушення за весь час аналізу.
                </li>
                <li><strong>Кількість замовників, що порушували, за обраний період</strong> - інтерактивний показник, що
                  відображає кількість унікальних замовників, у процедурах закупівель яких в процесі моніторингів було
                  знайдено хоча б одне порушення за обраний період.
                </li>
                <li><strong>Кількість процедур з порушенням (відсоток процедур з цим порушенням від усіх процедур з
                  порушеннями)</strong> - інтерактивний показник, що відображає кількість (відсоток від усіх процедур з
                  порушеннями) процедур, в яких було виявлено це порушення в обраному періоді.
                </li>
                <li><strong>Мапа розташування замовників/кількість їхніх процедур/сума їхніх процедур</strong> -
                  інтерактивна мапа розташування замовників/кількість їхніх процедур/сума їхніх процедур, де були
                  знайдені обрані порушення. За замовчуванням виводяться показники по усіх типах порушень.
                </li>
              </ol>
              <div className="filters-text">Фільтри на сторінці:</div>
              <ul className="ul-list">
                <li><strong>Фільтр вибору періоду</strong> - визначає період, для якого будується аналітика. Впливає на
                  показники <strong>2</strong>, <strong>3</strong> та <strong>4</strong>.
                </li>
                <li><strong>Фільтр вибору типу порушення</strong> (відбір елементів зі списку порушень, знаходиться
                  ліворуч від карти) - визначає тип/типи порушень, щодо яких будуватимуться показники. Впливає на
                  показники <strong>2</strong> і <strong>4</strong>.
                </li>
                <li><strong>Фільтр вибору підрозділу Держаудитслужби</strong> - відбір до аналізу лише тих порушень, що
                  виявили аудитори з обраного/обраних підрозділів. Впливає на
                  показники <strong>2</strong>, <strong>3</strong> і <strong>4</strong>.
                </li>
              </ul>
            </div>
            <div className="text-header">СТОРІНКА “РЕЗУЛЬТАТИ ПО ДЖЕРЕЛАХ”</div>
            <div className="text-content">
              Сторінка розроблена для аналізу ефективності джерел ініціації моніторингів.
              <ol className="ol-list">
                <li><strong>Вартість закупівель, що потрапили під моніторинг за весь час</strong> - статичний показник,
                  що відображає суму очікуваних вартостей процедур, щодо яких було проведено моніторинг.
                </li>
                <li><strong>Сума переможних тендерних пропозицій у процедурах, охоплених моніторингом за
                  період </strong> - сума переможних тендерних пропозицій у процедурах, щодо яких було проведено
                  моніторинг за обраний період.
                </li>
                <li><strong>Стовпчикова діаграма кількості моніторингів за підставами початку моніторингу</strong> -
                  інтерактивна діаграма, що відображає кількість моніторингів, розпочатих за кожною з п’яти причин,
                  визначених у Законі України “Про публічні закупівлі”. Для кожної причини кількість моніторингів
                  виводиться не одним загальним числом, а поділяється на результати проведення моніторингів
                  (зазначається числом та відсотком від загальної кількості моніторингів, що були розпочаті з цієї
                  причини). Якщо моніторинг має декілька причин початку, то він рахується для кожної з причин.
                </li>
                <li><strong>Діаграма ТОП-6 типів порушень</strong> - інтерактивна діаграма, що відображає топ-6 типів
                  порушень - за кількістю процедур, сумою очікуваних вартостей процедур чи кількістю унікальних
                  замовників, в процедурах яких були виявлені такі порушення, - що знаходяться у моніторингах,
                  розпочатих за обраними причиною чи причинами. За замовчуванням аналіз проводиться по всіх причинах.
                </li>
              </ol>
              <div className="filters-text">Фільтри на сторінці:</div>
              <ul className="ul-list">
                <li><strong>Фільтр вибору періоду</strong> - визначає період, для якого будується аналітика. Впливає на
                  показники <strong>2</strong>, <strong>3</strong> і <strong>4</strong>.
                </li>
                <li><strong>Фільтр “Регіон замовника”</strong> - визначає регіон чи регіони України, замовники з яких
                  проводили процедури закупівель, що потрапили до аналізу на цій сторінці. За замовчуванням аналітика
                  будується по всіх регіонах країни. Впливає на
                  показники <strong>2</strong>, <strong>3</strong> і <strong>4</strong>.
                </li>
                <li><strong>Фільтр вибору підрозділу Держаудитслужби</strong> - відбір до аналізу лише моніторингів, що
                  провели аудитори з обраного/обраних підрозділів. Впливає на
                  показники <strong>2</strong>, <strong>3</strong> і <strong>4</strong>.
                </li>
                <li><strong>Фільтр вибору причини початку моніторингу</strong> - відбір тільки тих моніторингів, що були
                  розпочаті лише за обраною причиною. Впливає на показник <strong>4</strong>.
                </li>
              </ul>
            </div>
            <div className="text-header">СТОРІНКА “РЕЗУЛЬТАТИ - ПО ПІДРОЗДІЛАМ ДЕРЖАУДИТСЛУЖБИ”</div>
            <div className="text-content">
              Навантаження на кожен з підрозділів Держаудитслужби може відрізнятись через різну кількість оголошень в
              різних регіонах. На цій сторінці можна переглянути дані про навантаження на кожен з підрозділів
              Держаудитслужби та результати, проведених ними моніторингів.
              <ol className="ol-list">
                <li><strong>Середня кількість порушень, виявлена підрозділами Держаудитслужби</strong> - статичний
                  показник, що демонструє середню кількість виявлених порушень, що припадає на територіальний підрозділ
                  Держаудитслужби за весь період аналізу.
                </li>
                <li><strong>Вартість процедур з виявленими порушеннями</strong> - інтерактивний показник, що відображає
                  суму очікуваних вартостей процедур закупівель, де були виявлені порушення за обраний період.
                </li>
                <li><strong>Список територіальних підрозділів з кількістю процедур, де було встановлено порушення
                  працівниками підрозділу</strong> - інтерактивний показник, що відображає кількість процедур, де було
                  встановлено порушення працівниками підрозділу Держаудитслужби за обраний період.
                </li>
                <li><strong>Динаміка процедур, де було встановлено порушення працівниками підрозділу</strong> -
                  інтерактивний показник, що відображає динаміку кількості процедур по місяцях обраного періоду, де було
                  встановлено порушення працівниками підрозділу Держаудитслужби.
                </li>
                <li><strong>Накопичувальна динаміка</strong> - графік динаміки кількості процедур з порушеннями, суми
                  очікуваних вартостей процедур, де було встановлено порушення, кількості замовників, в процедурах яких
                  було встановлено порушення.
                </li>
              </ol>
              <div className="filters-text">Фільтри на сторінці:</div>
              <ul className="ul-list">
                <li><strong>Фільтр вибору періоду</strong> - визначає період, для якого будується аналітика. Впливає на
                  показники <strong>2</strong>, <strong>3</strong>, <strong>4</strong> та <strong>5</strong>.
                </li>
                <li><strong>Фільтр вибору порушення</strong> - відбір показників лише за обраними видами порушень. За
                  замовчанням аналітика будується по всіх видах порушень. Впливає на
                  показники <strong>2</strong>, <strong>3</strong>, <strong>4</strong> та <strong>5</strong>.
                </li>
              </ul>
            </div>
          </div>
        </Col>
      </Row>
    </div>
  )
}

export default CalculationMethodology
